{
  "books": [
    {
      "author": "Jonathan Haidt",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003dItuzJhbcpMIC\u0026dq\u003dthe%2Brighteous%2Bmind\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 147,
      "isbn": "9780307907035",
      "labels": [],
      "language": "en",
      "pageCount": 384,
      "position": 0,
      "publishedDate": "2012-03-13",
      "rating": 0,
      "startDate": 0,
      "state": "WISHLIST",
      "subTitle": "Why Good People Are Divided by Politics and Religion",
      "summary": "New York Times Bestseller In this “landmark contribution to humanity’s understanding of itself” (The New York Times Book Review) social psychologist Jonathan Haidt challenges conventional thinking about morality, politics, and religion in a way that speaks to conservatives and liberals alike. Drawing on his twenty five years of groundbreaking research on moral psychology, Haidt shows how moral judgments arise not from reason but from gut feelings. He shows why liberals, conservatives, and libertarians have such different intuitions about right and wrong, and he shows why each side is actually right about many of its central concerns. In this subtle yet accessible book, Haidt gives you the key to understanding the miracle of human cooperation, as well as the curse of our eternal divisions and conflicts. If you’re ready to trade in anger for understanding, read The Righteous Mind.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dItuzJhbcpMIC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "The Righteous Mind",
      "wishlistDate": 0
    },
    {
      "author": "Nassim Nicholas Taleb",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003dGSBcQVd3MqYC\u0026dq\u003dblack%2Bswan\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 146,
      "isbn": "9780679604181",
      "labels": [],
      "language": "en",
      "pageCount": 480,
      "position": 0,
      "publishedDate": "2010-05-11",
      "rating": 0,
      "startDate": 0,
      "state": "WISHLIST",
      "subTitle": "The Impact of the Highly Improbable Fragility\"",
      "summary": "The Black Swan is a standalone book in Nassim Nicholas Taleb’s landmark Incerto series, an investigation of opacity, luck, uncertainty, probability, human error, risk, and decision-making in a world we don’t understand. The other books in the series are Fooled by Randomness, Antifragile, Skin in the Game, and The Bed of Procrustes. A black swan is a highly improbable event with three principal characteristics: It is unpredictable; it carries a massive impact; and, after the fact, we concoct an explanation that makes it appear less random, and more predictable, than it was. The astonishing success of Google was a black swan; so was 9/11. For Nassim Nicholas Taleb, black swans underlie almost everything about our world, from the rise of religions to events in our own personal lives. Why do we not acknowledge the phenomenon of black swans until after they occur? Part of the answer, according to Taleb, is that humans are hardwired to learn specifics when they should be focused on generalities. We concentrate on things we already know and time and time again fail to take into consideration what we don’t know. We are, therefore, unable to truly estimate opportunities, too vulnerable to the impulse to simplify, narrate, and categorize, and not open enough to rewarding those who can imagine the “impossible.” For years, Taleb has studied how we fool ourselves into thinking we know more than we actually do. We restrict our thinking to the irrelevant and inconsequential, while large events continue to surprise us and shape our world. In this revelatory book, Taleb explains everything we know about what we don’t know, and this second edition features a new philosophical and empirical essay, “On Robustness and Fragility,” which offers tools to navigate and exploit a Black Swan world. Elegant, startling, and universal in its applications, The Black Swan will change the way you look at the world. Taleb is a vastly entertaining writer, with wit, irreverence, and unusual stories to tell. He has a polymathic command of subjects ranging from cognitive science to business to probability theory. The Black Swan is a landmark book—itself a black swan. Praise for Nassim Nicholas Taleb “The most prophetic voice of all.”—GQ Praise for The Black Swan “[A book] that altered modern thinking.”—The Times (London) “A masterpiece.”—Chris Anderson, editor in chief of Wired, author of The Long Tail “Idiosyncratically brilliant.”—Niall Ferguson, Los Angeles Times “The Black Swan changed my view of how the world works.”—Daniel Kahneman, Nobel laureate “[Taleb writes] in a style that owes as much to Stephen Colbert as it does to Michel de Montaigne. . . . We eagerly romp with him through the follies of confirmation bias [and] narrative fallacy.”—The Wall Street Journal “Hugely enjoyable—compelling . . . easy to dip into.”—Financial Times “Engaging . . . The Black Swan has appealing cheek and admirable ambition.”—The New York Times Book Review",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dGSBcQVd3MqYC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "The Black Swan: Second Edition",
      "wishlistDate": 0
    },
    {
      "author": "Paulo Coelho",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003dluYhpFXictEC\u0026dq\u003d9780062511409\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 145,
      "isbn": "9780062511409",
      "labels": [],
      "language": "es",
      "pageCount": 192,
      "position": 0,
      "publishedDate": "1994-10-07",
      "rating": 0,
      "startDate": 0,
      "state": "WISHLIST",
      "subTitle": "Una Fabula Para Seguir Tus Suenos",
      "summary": "La mÁgica historia de Paulo Coelho, que trata sobre Santiago, un niÑo pastor andaluz que viaja en busca de un tesoro material, nos enseÑa la importancia que tiene el saber eschuchar lo que nos dice el corazÓn, a aprender a leer los presagios dispersados por el camino de nuestras vidas y, sobre todo, a seguir nuestros sueÑos. El Alquimista, ahora por primera vez disponible en EspaÑa en Norte America, ha sido aclamado en EspaÑa y en America Latina como una de las novelas mas importantes de la dÉcada.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dluYhpFXictEC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "El Alquimista",
      "wishlistDate": 0
    },
    {
      "author": "Robert B. Cialdini, PhD",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003d5dfv0HJ1TEoC\u0026source\u003dgbs_api",
      "id": 144,
      "isbn": "9780061899874",
      "labels": [],
      "language": "en",
      "pageCount": 336,
      "position": 0,
      "publishedDate": "2009-06-02",
      "rating": 0,
      "startDate": 0,
      "state": "WISHLIST",
      "subTitle": "The Psychology of Persuasion",
      "summary": "Influence, the classic book on persuasion, explains the psychology of why people say \"yes\"—and how to apply these understandings. Dr. Robert Cialdini is the seminal expert in the rapidly expanding field of influence and persuasion. His thirty-five years of rigorous, evidence-based research along with a three-year program of study on what moves people to change behavior has resulted in this highly acclaimed book. You\u0027ll learn the six universal principles, how to use them to become a skilled persuader—and how to defend yourself against them. Perfect for people in all walks of life, the principles of Influence will move you toward profound personal change and act as a driving force for your success. Some images that appeared in the print edition of this book are unavailable in the electronic edition due to rights reasons.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d5dfv0HJ1TEoC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Influence",
      "wishlistDate": 0
    },
    {
      "author": "James Clear",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "http://books.google.it/books?id\u003dXfFvDwAAQBAJ\u0026dq\u003datomic%2Bhabits\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 143,
      "isbn": "9780735211292",
      "labels": [],
      "language": "en",
      "pageCount": 306,
      "position": 0,
      "publishedDate": "2018",
      "rating": 0,
      "startDate": 0,
      "state": "WISHLIST",
      "subTitle": "Tiny Changes, Remarkable Results : an Easy \u0026 Proven Way to Build Good Habits \u0026 Break Bad Ones",
      "summary": "James Clear presents strategies to form good habits, break bad ones, and master the tiny behaviors that help lead to an improved life.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dXfFvDwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Atomic Habits",
      "wishlistDate": 0
    },
    {
      "author": "Geoffrey A. Moore",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dwUEHAQAAQBAJ\u0026source\u003dgbs_api",
      "id": 142,
      "isbn": "9780062293008",
      "labels": [
        {
          "bookId": 142,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "en",
      "pageCount": 273,
      "position": 2,
      "publishedDate": "2014-01-28",
      "rating": 0,
      "startDate": 0,
      "state": "READ_LATER",
      "subTitle": "Marketing and Selling Disruptive Products to Mainstream Customers",
      "summary": "The bible for bringing cutting-edge products to larger markets—now revised and updated with new insights into the realities of high-tech marketing In Crossing the Chasm, Geoffrey A. Moore shows that in the Technology Adoption Life Cycle—which begins with innovators and moves to early adopters, early majority, late majority, and laggards—there is a vast chasm between the early adopters and the early majority. While early adopters are willing to sacrifice for the advantage of being first, the early majority waits until they know that the technology actually offers improvements in productivity. The challenge for innovators and marketers is to narrow this chasm and ultimately accelerate adoption across every segment. This third edition brings Moore\u0027s classic work up to date with dozens of new examples of successes and failures, new strategies for marketing in the digital world, and Moore\u0027s most current insights and findings. He also includes two new appendices, the first connecting the ideas in Crossing the Chasm to work subsequently published in his Inside the Tornado, and the second presenting his recent groundbreaking work for technology adoption models for high-tech consumer markets.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dwUEHAQAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Crossing the Chasm, 3rd Edition",
      "wishlistDate": 1608030196263
    },
    {
      "author": "Roald Dahl",
      "currentPage": 0,
      "endDate": 0,
      "id": 141,
      "isbn": "9783499290312",
      "labels": [],
      "language": "de",
      "pageCount": 531,
      "position": 5,
      "publishedDate": "2016",
      "rating": 0,
      "startDate": 0,
      "state": "READ_LATER",
      "subTitle": "25 ungewöhnliche Geschichten",
      "summary": "",
      "thumbnailAddress": "https://firebasestorage.googleapis.com/v0/b/dante-166506.appspot.com/o/custom_images%2F5w6U2PlW2OhsWGaPspY7SwXQB2L2%2Fimage%3A7166?alt\u003dmedia\u0026token\u003d88244012-c418-4e84-9f2e-6cc038872e14",
      "title": "Alle Küsschen!",
      "wishlistDate": 1607705477096
    },
    {
      "author": "George Orwell",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003d3QQbAwAAQBAJ\u0026source\u003dgbs_api",
      "id": 140,
      "isbn": "9783843701419",
      "labels": [
        {
          "bookId": 140,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 383,
      "position": 6,
      "publishedDate": "2011-08-12",
      "rating": 0,
      "startDate": 0,
      "state": "READ_LATER",
      "subTitle": "in der Übersetzung von Michael Walter",
      "summary": "\"Freiheit bedeutet die Freiheit, zu sagen, daß zwei und zwei vier ist. Gilt dies, ergibt sich alles übrige von selbst.\" Der Klassiker über einen allmächtigen Überwachungsstaat ist und bleibt beklemmend aktuell: Mit 1984 schuf George Orwell eines der einflußreichsten Bücher des 20. Jahrhunderts.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d3QQbAwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "1984",
      "wishlistDate": 1607699176241
    },
    {
      "author": "Wright Thompson",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003djnWKDwAAQBAJ\u0026source\u003dgbs_api",
      "id": 139,
      "isbn": "9781788701976",
      "labels": [],
      "language": "en",
      "pageCount": 400,
      "position": 0,
      "publishedDate": "2019-04-08",
      "rating": 0,
      "startDate": 0,
      "state": "WISHLIST",
      "subTitle": "Sports Stories and Other Serious Business",
      "summary": "The New York Times bestseller \u0027Full of rich characters, bad actors, heroes, drama, suffering, courage, conflict, and vivid detail\u0027 John Grisham **************** From one of America\u0027s most beloved sportswriters, a collection of true stories about the dream of greatness and its cost in the world of sports. There is only one Wright Thompson. His work includes the most read articles in the history of ESPN and has been anthologised in The Best American Sports Writing books ten times. But to say his pieces are about sports, while true as far as it goes, is like saying Larry McMurty\u0027s Lonesome Dove is a book about a cattle drive. Wright Thompson figures people out. Whether it be Michael Jordan or Tiger Woods or Lionel Messi or Pat Riley, he strips away the self-serving myths and fantasies to fully reveal his characters, and what drives them, in a way that few others can. Ludicrously entertaining and often powerfully moving, The Cost of These Dreams is an ode to the reporter\u0027s art and a celebration of true greatness and the high price that it exacts. **************** \u0027Wright Thompson performs that nifty bit of sportswriting hoodoo, virtually out of vogue today: he subordinates self to story. Stylishly, intelligently, incisively, deftly, he keeps his priorities straight. It\u0027s why I read him\u0027 Richard Ford \u0027Wright Thompson is not only the best active sportswriter in America but also one of the best writers, period. This collection compiles his greatest pieces\u0027 Men\u0027s Journal",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003djnWKDwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "The Cost of These Dreams",
      "wishlistDate": 0
    },
    {
      "author": "Gene Kim, Kevin Behr, George Spafford",
      "currentPage": 146,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003d_EnZAQAACAAJ\u0026dq\u003d9781942788294\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 135,
      "isbn": "9781942788294",
      "labels": [
        {
          "bookId": 135,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "pageCount": 432,
      "position": 1,
      "publishedDate": "2018-02-27",
      "rating": 0,
      "startDate": 1609315974087,
      "state": "READING",
      "subTitle": "A Novel about IT, DevOps, and Helping Your Business Win",
      "summary": "Bill has 90 days to fix a behind-schedule IT project, or his entire department will be outsourced. Fortunately, he has the help of a prospective board member, whose \"Three Ways\" philosophy might just save the day.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d_EnZAQAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "The Phoenix Project",
      "wishlistDate": 1606221761553
    },
    {
      "author": "Ryan Holiday",
      "currentPage": 10,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003dazA7DwAAQBAJ\u0026dq\u003ddaily%2Bstoic%2Bjournal\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 133,
      "isbn": "9780525534396",
      "labels": [
        {
          "bookId": 133,
          "hexColor": "#ff3f51b5",
          "title": "Stoicism"
        },
        {
          "bookId": 133,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        },
        {
          "bookId": 133,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        }
      ],
      "language": "en",
      "pageCount": 336,
      "position": 2,
      "publishedDate": "2017",
      "rating": 0,
      "startDate": 1609527911760,
      "state": "READING",
      "subTitle": "366 Days of Writing and Reflection on the Art of Living",
      "summary": "Ryan Holiday has led the popular revival of stoicism since 2014, with his acclaimed bestsellers The Obstacle is the Way, Ego is the Enemy, and-in partnership with Stephen Hanselman-The Daily Stoic. The latter offered powerful quotations, fresh anecdotes, and insightful commentary about the wisdom of Epictetus, Seneca, and Marcus Aurelius. Now Holiday and Hanselman are back with The Daily Stoic Journal, an interactive guide to integrating this ancient philosophy into our 21st century lives. Readers will find weekly explanations and quotations to inspire deeper reflection on Stoic practices, daily prompts, and a helpful introduction explaining the various Stoic tools of self-management. This beautifully designed hardcover journal features space for morning and evening notes, along with advice to encourage ongoing writing and insights, day by day through the year. This is the perfect companion volume for people who already love The Daily Stoic, but it can also be used as a stand-alone journal. It will help anyone seeking inner peace and clarity in our crazy world, even those who have never previously encountered Stoicism.",
      "thumbnailAddress": "https://books.google.com/books/content?id\u003dazA7DwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "The Daily Stoic Journal",
      "wishlistDate": 1597010400000
    },
    {
      "author": "Viktor E. Frankl",
      "currentPage": 192,
      "endDate": 1609225667239,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003d46lH0NMFnqsC\u0026source\u003dgbs_api",
      "id": 132,
      "isbn": "9783641059033",
      "labels": [
        {
          "bookId": 132,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        }
      ],
      "language": "de",
      "pageCount": 192,
      "position": 0,
      "publishedDate": "2010-12-09",
      "rating": 5,
      "startDate": 1609075496861,
      "state": "READ",
      "subTitle": "Ein Psychologe erlebt das Konzentrationslager",
      "summary": "Mehrere Jahre musste der österreichische Psychologe Viktor E. Frankl in deutschen Konzentrationslagern verbringen. Doch trotz all des Leids, das er dort sah und erlebte, kam er zu dem Schluss, dass es selbst an Orten der größten Unmenschlichkeit möglich ist, einen Sinn im Leben zu sehen. Seine Erinnerungen, die er in diesem Buch festhielt und die über Jahrzehnte Millionen von Menschen bewegten, sollen weder Mitleid erregen noch Anklage erheben. Sie sollen Kraft zum Leben geben.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d46lH0NMFnqsC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "... trotzdem Ja zum Leben sagen",
      "wishlistDate": 1602243531094
    },
    {
      "author": "Robert Levine",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003dqVNYPgAACAAJ\u0026dq\u003d9780471763178\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 131,
      "isbn": "9780471763178",
      "labels": [
        {
          "bookId": 131,
          "hexColor": "#ff2196f3",
          "title": "Science"
        }
      ],
      "language": "en",
      "pageCount": 278,
      "position": 4,
      "publishedDate": "2006-01-23",
      "rating": 0,
      "startDate": 0,
      "state": "READ_LATER",
      "subTitle": "How We\u0027re Bought and Sold",
      "summary": "\"An engaging, highly readable survey of the sophisticated methods of persuasion we encounter in various situations. From television to telemarketing and from self-deception to suicide cults, Levine takes a hard look at all the ways we attempt to persuade each other--and how and why they work (or don\u0027t). . . . The next time you wonder what possessed you to pay $50 for a medallion commemorating the series finale of Friends, you\u0027ll know where to turn.\" --Slashdot.org \"If you\u0027re like most people, you think advertising and marketing work--just not on you. Robert Levine\u0027s The Power of Persuasion demonstrates how even the best-educated cynics among us can be victimized by sales pitches.\" --The Globe and Mail \"Levine puts [his] analysis in the service of his real mission--to arm the reader against manipulation.\" --The Wall Street Journal \"This wonderful book will change the way you think and act in many realms of your life.\" --Philip Zimbardo former president, American Psychological Association",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dqVNYPgAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "The Power of Persuasion",
      "wishlistDate": 1602243513992
    },
    {
      "author": "Greg McKeown",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003dpK7PBQAAQBAJ\u0026dq\u003d9780753555163\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 130,
      "isbn": "9780753555163",
      "labels": [
        {
          "bookId": 130,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        },
        {
          "bookId": 130,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        }
      ],
      "language": "en",
      "pageCount": 260,
      "position": 7,
      "publishedDate": "2014",
      "rating": 0,
      "startDate": 0,
      "state": "READ_LATER",
      "subTitle": "The Disciplined Pursuit of Less",
      "summary": "Have you ever found yourself struggling with information overload? Have you ever felt both overworked and underutilised? Do you ever feel busy but not productive? If you answered yes to any of these, the way out is to become an Essentialist. In Essentialism, Greg McKeown, CEO of a Leadership and Strategy agency in Silicon Valley who has run courses at Apple, Google and Facebook, shows you how to achieve what he calls the disciplined pursuit of less. Being an Essentialist is about a disciplined way of thinking. It means challenging the core assumption of âe~We can have it allâe(tm) and âe~I have to do everythingâe(tm) and replacing it with the pursuit of âe~the right thing, in the right way, at the right time\u0027. By applying a more selective criteria for what is essential, the pursuit of less allows us to regain control of our own choices so we can channel our time, energy and effort into making the highest possible contribution toward the goals and activities that matter. Using the experience and insight of working with the leaders of the most innovative companies and organisations in the world, McKeown shows you how to put Essentialism into practice in your own life, so you too can achieve something great.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dpK7PBQAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Essentialism",
      "wishlistDate": 1602243505530
    },
    {
      "author": "Cal Newport",
      "currentPage": 27,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003duS9eDwAAQBAJ\u0026dq\u003d9780525542872\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 129,
      "isbn": "9780525536543",
      "labels": [
        {
          "bookId": 129,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        },
        {
          "bookId": 129,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        }
      ],
      "language": "en",
      "pageCount": 284,
      "position": 1,
      "publishedDate": "2019-02-05",
      "rating": 0,
      "startDate": 1609798524222,
      "state": "READING",
      "subTitle": "Choosing a Focused Life in a Noisy World",
      "summary": "A New York Times, Wall Street Journal, Publishers Weekly, and USA Today bestseller \"Newport is making a bid to be the Marie Kondo of technology: someone with an actual plan for helping you realize the digital pursuits that do, and don\u0027t, bring value to your life.\"--Ezra Klein, Vox Minimalism is the art of knowing how much is just enough. Digital minimalism applies this idea to our personal technology. It\u0027s the key to living a focused life in an increasingly noisy world. In this timely and enlightening book, the bestselling author of Deep Work introduces a philosophy for technology use that has already improved countless lives. Digital minimalists are all around us. They\u0027re the calm, happy people who can hold long conversations without furtive glances at their phones. They can get lost in a good book, a woodworking project, or a leisurely morning run. They can have fun with friends and family without the obsessive urge to document the experience. They stay informed about the news of the day, but don\u0027t feel overwhelmed by it. They don\u0027t experience \"fear of missing out\" because they already know which activities provide them meaning and satisfaction. Now, Newport gives us a name for this quiet movement, and makes a persuasive case for its urgency in our tech-saturated world. Common sense tips, like turning off notifications, or occasional rituals like observing a digital sabbath, don\u0027t go far enough in helping us take back control of our technological lives, and attempts to unplug completely are complicated by the demands of family, friends and work. What we need instead is a thoughtful method to decide what tools to use, for what purposes, and under what conditions. Drawing on a diverse array of real-life examples, from Amish farmers to harried parents to Silicon Valley programmers, Newport identifies the common practices of digital minimalists and the ideas that underpin them. He shows how digital minimalists are rethinking their relationship to social media, rediscovering the pleasures of the offline world, and reconnecting with their inner selves through regular periods of solitude. He then shares strategies for integrating these practices into your life, starting with a thirty-day \"digital declutter\" process that has already helped thousands feel less overwhelmed and more in control. Technology is intrinsically neither good nor bad. The key is using it to support your goals and values, rather than letting it use you. This book shows the way.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003duS9eDwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Digital Minimalism",
      "wishlistDate": 1602243486597
    },
    {
      "author": "Malcolm Gladwell",
      "currentPage": 280,
      "endDate": 1608482494657,
      "googleBooksLink": "http://books.google.at/books?id\u003dGqepQgAACAAJ\u0026dq\u003d9780316679077\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 128,
      "isbn": "9780316679077",
      "labels": [
        {
          "bookId": 128,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        },
        {
          "bookId": 128,
          "hexColor": "#ff2196f3",
          "title": "Science"
        }
      ],
      "language": "en",
      "pageCount": 280,
      "position": 0,
      "publishedDate": "2001",
      "rating": 4,
      "startDate": 1607288794223,
      "state": "READ",
      "subTitle": "How Little Things Can Make a Big Difference",
      "summary": "The Tipping Point is the biography of an idea, and the idea is quite simple: that many of the problems we face - from murder to teenage delinquency to traffic jams - behave like epidemics. They aren\u0027t linear phenomena in the sense that they steadily and predictably change according to the level of effort brought to bear against them. They are capable of sudden and dramatic changes in direction. Years of well-intentioned intervention may have no impact at all, yet the right intervention - at just the right time - can start a cascade of change.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dGqepQgAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "The Tipping Point",
      "wishlistDate": 1602243478791
    },
    {
      "author": "Ryan Holiday",
      "currentPage": 319,
      "endDate": 1609075491144,
      "googleBooksLink": "http://books.google.at/books?id\u003dUFCzugEACAAJ\u0026dq\u003d9781788160841\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 127,
      "isbn": "9781788160841",
      "labels": [],
      "language": "en",
      "pageCount": 319,
      "position": 1,
      "publishedDate": "2019-02-28",
      "rating": 4,
      "startDate": 1608116400000,
      "state": "READ",
      "subTitle": "Peter Thiel, Hulk Hogan, Gawker, and the Anatomy of Intrigue",
      "summary": "Conspiracy theories are legion. Conspiracies are rare. And of the few that do exist, fewer are ever discovered, let alone explained. This story is the exception.In 2016, media giant Gawker was forced to declare bankruptcy after a $140 million dollar judgment in court over an illegally recorded sex tape of Hulk Hogan. The case was no accident: it was the result of a nearly decade-long plot masterminded by Facebook and Paypal billionaire Peter Thiel.With exclusive access to all the key players, Ryan Holiday takes us behind the scenes of this extraordinary and at times surreal story, and transforms the events into both a dissection of that controversial methodology - conspiracy - and an eye-opening cautionary tale on the use, abuse and consequences of power and secrecy in the modern age.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dUFCzugEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Conspiracy",
      "wishlistDate": 1602243436345
    },
    {
      "author": "Seth Godin",
      "currentPage": 80,
      "endDate": 1603258283472,
      "googleBooksLink": "http://books.google.at/books?id\u003dG2wZGQAACAAJ\u0026dq\u003d9780749928308\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 126,
      "isbn": "9780749928308",
      "labels": [
        {
          "bookId": 126,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        },
        {
          "bookId": 126,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        }
      ],
      "language": "en",
      "pageCount": 80,
      "position": 7,
      "publishedDate": "2007",
      "rating": 3,
      "startDate": 1603090445889,
      "state": "READ",
      "subTitle": "The Extraordinary Benefits of Knowing when to Quit (and when to Stick)",
      "summary": "Business.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dG2wZGQAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "The Dip",
      "wishlistDate": 1602243424753
    },
    {
      "author": "Ryan Holiday",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003diytIzQEACAAJ\u0026dq\u003d9781788162609\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 125,
      "isbn": "9781788162609",
      "labels": [
        {
          "bookId": 125,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        },
        {
          "bookId": 125,
          "hexColor": "#ff3f51b5",
          "title": "Stoicism"
        }
      ],
      "language": "en",
      "pageCount": 330,
      "position": 3,
      "publishedDate": "2020-09-24",
      "rating": 0,
      "startDate": 0,
      "state": "READ_LATER",
      "subTitle": "Lessons on the Art of Living from Zeno to Marcus Aurelius",
      "summary": "",
      "thumbnailAddress": "https://books.google.com/books/content?id\u003diytIzQEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "The Lives of the Stoics",
      "wishlistDate": 1601986669268
    },
    {
      "author": "Geoff Smart, Randy Street",
      "currentPage": 188,
      "endDate": 1602495379292,
      "googleBooksLink": "http://books.google.at/books?id\u003dI7TdFn4bxaAC\u0026dq\u003d9780345504197\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 124,
      "isbn": "9780345504197",
      "labels": [
        {
          "bookId": 124,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "en",
      "pageCount": 188,
      "position": 0,
      "publishedDate": "2008",
      "rating": 0,
      "startDate": 1602062397966,
      "state": "READ",
      "subTitle": "The A Method for Hiring",
      "summary": "A manager\u0027s guide to hiring the right employees introduces the practical and effective A Method for Hiring, which draws on the expertise of hundreds of high-level executives to present a simple, easy-to-follow program to guarantee hiring success. 50,000 first printing.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dI7TdFn4bxaAC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Who",
      "wishlistDate": 1601986660162
    },
    {
      "author": "Jocko Willink",
      "currentPage": 200,
      "endDate": 1603038505299,
      "googleBooksLink": "http://books.google.at/books?id\u003dHF06DwAAQBAJ\u0026dq\u003d9781250156945\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 123,
      "isbn": "9781250156945",
      "labels": [
        {
          "bookId": 123,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        }
      ],
      "language": "en",
      "pageCount": 200,
      "position": 1,
      "publishedDate": "2017-10-17",
      "rating": 5,
      "startDate": 1602010924122,
      "state": "READ",
      "subTitle": "Field Manual",
      "summary": "Jocko Willink\u0027s methods for success were born in the SEAL Teams, where he spent most of his adult life, enlisting after high school and rising through the ranks to become the commander of the most highly decorated special operations unit of the war in Iraq. Here he describes how he lives that mantra: the mental and physical disciplines he imposes on himself in order to achieve freedom in all aspects of life. Willink includes strategies and tactics for conquering weakness, procrastination, and fear; specific physical training presented in workouts for beginner, intermediate, and advanced athletes; and the best sleep habits and food intake recommended to optimize performance.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dHF06DwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Discipline Equals Freedom",
      "wishlistDate": 1601986649059
    },
    {
      "author": "Robin Nixon",
      "currentPage": 797,
      "endDate": 1605530225837,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dvlZaDwAAQBAJ\u0026source\u003dgbs_api",
      "id": 122,
      "isbn": "9781491979099",
      "labels": [
        {
          "bookId": 122,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "pageCount": 797,
      "position": 8,
      "publishedDate": "2018-05-09",
      "rating": 2,
      "startDate": 1604313104161,
      "state": "READ",
      "subTitle": "With jQuery, CSS \u0026 HTML5",
      "summary": "Build interactive, data-driven websites with the potent combination of open source technologies and web standards, even if you have only basic HTML knowledge. In this update to this popular hands-on guide, you’ll tackle dynamic web programming with the latest versions of today’s core technologies: PHP, MySQL, JavaScript, CSS, HTML5, and key jQuery libraries. Web designers will learn how to use these technologies together and pick up valuable web programming practices along the way—including how to optimize websites for mobile devices. At the end of the book, you’ll put everything together to build a fully functional social networking site suitable for both desktop and mobile browsers. Explore MySQL, from database structure to complex queries Use the MySQLi extension, PHP’s improved MySQL interface Create dynamic PHP web pages that tailor themselves to the user Manage cookies and sessions and maintain a high level of security Enhance the JavaScript language with jQuery and jQuery mobile libraries Use Ajax calls for background browser-server communication Style your web pages by acquiring CSS2 and CSS3 skills Implement HTML5 features, including geolocation, audio, video, and the canvas element Reformat your websites into mobile web apps",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dvlZaDwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Learning PHP, MySQL \u0026 JavaScript",
      "wishlistDate": 1599461999916
    },
    {
      "author": "Dante Alighieri",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dqq5TBq5RHgwC\u0026source\u003dgbs_api",
      "id": 121,
      "isbn": "9783849608972",
      "labels": [
        {
          "bookId": 121,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 555,
      "position": 10,
      "publishedDate": "2012",
      "rating": 0,
      "startDate": 0,
      "state": "READ_LATER",
      "subTitle": "",
      "summary": "Die Serie \"Meisterwerke der Literatur\" beinhaltet die Klassiker der deutschen und weltweiten Literatur in einer einzigartigen Sammlung. Lesen Sie die besten Werke großer Schriftsteller,Poeten, Autoren und Philosophen auf Ihrem elektronischen Lesegerät. Dieses Werk bietet zusätzlich * Eine Biografie/Bibliografie des Autors. Die Commedia (italienisch für ‚Komödie‘), in späterer Zeit auch Divina Commedia (‚Göttliche Komödie‘) genannt, ist das Hauptwerk des italienischen Dichters Dante Alighieri (1265–1321). Sie entstand während der Jahre seines Exils und wurde wahrscheinlich um 1307 begonnen und erst kurze Zeit vor seinem Tod vollendet. Sie gilt als bedeutendste Dichtung der italienischen Literatur und als eines der größten Werke der Weltliteratur. (aus wikipedia.de)",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dqq5TBq5RHgwC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Die göttliche Komödie",
      "wishlistDate": 1446678000000
    },
    {
      "author": "Charles Dickens",
      "currentPage": 741,
      "endDate": 1607262551818,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003d959ECgAAQBAJ\u0026source\u003dgbs_api",
      "id": 120,
      "isbn": "9783458770305",
      "labels": [
        {
          "bookId": 120,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 741,
      "position": 1,
      "publishedDate": "2011-11-16",
      "rating": 0,
      "startDate": 1601815785514,
      "state": "READ",
      "subTitle": "",
      "summary": "Dem Waisenjungen Pip werden »große Erwartungen« eröffnet: Ein unbekannter Gönner will ihn fördern. In London vergißt er sein einfaches Dorfleben und genießt ein verschwenderisches Dasein. Durch das Auftauchen seines Wohltäters gerät er in eine lebensgefährliche Lage. »Es gibt 100 000 Bücher, die schön sind; 10 000, die sehr schön sind; 1 000, die noch viel schöner sind als alle die anderen. Und es gibt 100 Bücher, die den lieben Gott zum Weinen bringen: Eines davon ist Charles Dickens’ Große Erwartungen.« Die Rheinpfalz",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d959ECgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Große Erwartungen",
      "wishlistDate": 1446678000000
    },
    {
      "author": "Brian W. Kernighan, Dennis Ritchie",
      "currentPage": 272,
      "endDate": 1597430120881,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dYi5FI5QcdmYC\u0026source\u003dgbs_api",
      "id": 118,
      "isbn": "9780133086218",
      "labels": [
        {
          "bookId": 118,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "pageCount": 272,
      "position": 17,
      "publishedDate": "1988-03-22",
      "rating": 4,
      "startDate": 1596128966547,
      "state": "READ",
      "subTitle": "",
      "summary": "This ebook is the first authorized digital version of Kernighan and Ritchie’s 1988 classic, The C Programming Language (2nd Ed.). One of the best-selling programming books published in the last fifty years, \"K\u0026R\" has been called everything from the \"bible\" to \"a landmark in computer science\" and it has influenced generations of programmers. Available now for all leading ebook platforms, this concise and beautifully written text is a \"must-have\" reference for every serious programmer’s digital library. As modestly described by the authors in the Preface to the First Edition, this \"is not an introductory programming manual; it assumes some familiarity with basic programming concepts like variables, assignment statements, loops, and functions. Nonetheless, a novice programmer should be able to read along and pick up the language, although access to a more knowledgeable colleague will help.\"",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dYi5FI5QcdmYC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "C Programming Language",
      "wishlistDate": 1594332000000
    },
    {
      "author": "Reid Hoffman, Chris Yeh",
      "currentPage": 325,
      "endDate": 1596916795797,
      "googleBooksLink": "http://books.google.at/books?id\u003dCVlUtAEACAAJ\u0026dq\u003d9781984822451\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 117,
      "isbn": "9781984822451",
      "labels": [
        {
          "bookId": 117,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "en",
      "pageCount": 325,
      "position": 2,
      "publishedDate": "2018-10-09",
      "rating": 4,
      "startDate": 1595410795960,
      "state": "READ",
      "subTitle": "The Lightning-Fast Path to Building Massively Valuable Companies",
      "summary": "What entrepreneur or founder doesnt aspire to build the next Amazon, Facebook, or Airbnb? Yet those who actually manage to do so are exceedingly rare. So what separates the startups that get disrupted and disappear from the ones who grow to become global giants? The secret is blitzscaling: a set of techniques for scaling up at a dizzying pace that blows competitors out of the water. The objective of Blitzscaling is not to go from zero to one, but from one to one billion as quickly as possible.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dCVlUtAEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Blitzscaling",
      "wishlistDate": 1594460391081
    },
    {
      "author": "Malcolm Gladwell",
      "currentPage": 365,
      "endDate": 1597900087844,
      "googleBooksLink": "http://books.google.at/books?id\u003dEblsvgEACAAJ\u0026dq\u003d9780316056281\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 116,
      "isbn": "9780316056281",
      "labels": [
        {
          "bookId": 116,
          "hexColor": "#ff2196f3",
          "title": "Science"
        },
        {
          "bookId": 116,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "en",
      "pageCount": 365,
      "position": 3,
      "publishedDate": "2009",
      "rating": 5,
      "startDate": 1594398239541,
      "state": "READ",
      "subTitle": "The Story of Success",
      "summary": "Identifies the qualities of successful people, maintaining that culture, family, and idiosyncratic factors can have a decisive impact on shaping high achievers,",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dEblsvgEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Outliers",
      "wishlistDate": 1594375200000
    },
    {
      "author": "Clive Thompson",
      "currentPage": 436,
      "endDate": 1592126245464,
      "googleBooksLink": "http://books.google.at/books?id\u003dGcvSDwAAQBAJ\u0026dq\u003d9780735220584\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 115,
      "isbn": "9780735220584",
      "labels": [],
      "language": "en",
      "pageCount": 436,
      "position": 9,
      "publishedDate": "2020-03-24",
      "rating": 3,
      "startDate": 1591249067178,
      "state": "READ",
      "subTitle": "The Making of a New Tribe and the Remaking of the World",
      "summary": "Facebook\u0027s algorithms shaping the news. Self-driving cars roaming the streets. Revolution on Twitter and romance on Tinder. We live in a world constructed of code--and coders are the ones who built it for us. Programmers shape our everyday behavior: When they make something easy to do, we do more of it. When they make it hard or impossible, we do less of it. From acclaimed tech writer Clive Thompson comes a brilliant anthropological reckoning with the most powerful tribe in the world today, computer programmers, in a book that interrogates who they are, how they think, what qualifies as greatness in their world, and what should give us pause. In pop culture and media, the people who create the code that rules our world are regularly portrayed in hackneyed, simplified terms, as ciphers in hoodies. Thompson goes far deeper, taking us close to some of the great programmers of our time, including the creators of Facebook\u0027s News Feed, Instagram, Google\u0027s cutting-edge AI, and more. Speaking to everyone from revered \"10X\" elites to neophytes, back-end engineers and front-end designers, Thompson explores the distinctive psychology of this vocation--which combines a love of logic, an obsession with efficiency, the joy of puzzle-solving, and a superhuman tolerance for mind-bending frustration. Along the way, Coders ponders the morality and politics of code, including its implications for civic life and the economy and the major controversies of our era. In accessible, erudite prose, Thompson unpacks the surprising history of the field, beginning with the first coders -- brilliant and pioneering women, who, despite crafting some of the earliest personal computers and programming languages, were later written out of history. At the same time, the book deftly illustrates how programming has become a marvelous new art form--a source of delight and creativity, not merely danger. To get as close to his subject as possible, Thompson picks up the thread of his own long-abandoned coding skills as he reckons, in his signature, highly personal style, with what superb programming looks like. To understand the world today, we need to understand code and its consequences. With Coders, Thompson gives a definitive look into the heart of the machine.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dGcvSDwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Coders",
      "wishlistDate": 1590164055934
    },
    {
      "author": "Tony Robbins",
      "currentPage": 250,
      "endDate": 1594922943046,
      "googleBooksLink": "http://books.google.at/books?id\u003d1C2HtAEACAAJ\u0026dq\u003d9783959720595\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 114,
      "isbn": "9783959720595",
      "labels": [
        {
          "bookId": 114,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        }
      ],
      "language": "de",
      "pageCount": 250,
      "position": 18,
      "publishedDate": "2017-10-16",
      "rating": 0,
      "startDate": 1594148895600,
      "state": "READ",
      "subTitle": "Deine Strategie für finanzielle Freiheit",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d1C2HtAEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "UNANGREIFBAR",
      "wishlistDate": 1590141600000
    },
    {
      "author": "Ichiro Kishimi, Fumitake Koga",
      "currentPage": 272,
      "endDate": 1594147303531,
      "googleBooksLink": "http://books.google.at/books?id\u003ddgzyuQEACAAJ\u0026dq\u003d9781760630737\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 113,
      "isbn": "9781760630737",
      "labels": [
        {
          "bookId": 113,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        },
        {
          "bookId": 113,
          "hexColor": "#ff009688",
          "title": "Favorites"
        }
      ],
      "language": "en",
      "pageCount": 272,
      "position": 12,
      "publishedDate": "2019",
      "rating": 5,
      "startDate": 1593356258495,
      "state": "READ",
      "subTitle": "How to Free Yourself, Change Your Life and Achieve Real Happiness",
      "summary": "The Japanese phenomenon that teaches us the simple yet profound lessons required to liberate our real selves and find lasting happiness. The Courage to be Disliked shows you how to unlock the power within yourself to become your best and truest self, change your future and find lasting happiness. Using the theories of Alfred Adler, one of the three giants of 19th century psychology alongside Freud and Jung, the authors explain how we are all free to determine our own future free of the shackles of past experiences, doubts and the expectations of others. It\u0027s a philosophy that\u0027s profoundly liberating, allowing us to develop the courage to change, and to ignore the limitations that we and those around us can place on ourselves. The result is a book that is both highly accessible and profound in its importance. Millions have already read and benefited from its wisdom. Now that The Courage to be Disliked has been published for the first time in English, so can you.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003ddgzyuQEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "The Courage To Be Disliked",
      "wishlistDate": 1590164020522
    },
    {
      "author": "Simon Sinek",
      "currentPage": 246,
      "endDate": 1593113085601,
      "googleBooksLink": "http://books.google.at/books?id\u003dn00dkgEACAAJ\u0026dq\u003d9780241958223\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 112,
      "isbn": "9780241958223",
      "labels": [
        {
          "bookId": 112,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "en",
      "pageCount": 246,
      "position": 14,
      "publishedDate": "2011",
      "rating": 0,
      "startDate": 1592155155214,
      "state": "READ",
      "subTitle": "How Great Leaders Inspire Everyone to Take Action",
      "summary": "Why are some people and organisations more inventive, pioneering and successful than others?And why are they able to repeat their success again and again? Because in business, it doesn\u0027t matter what you do, it matters why you do it. Steve Jobs, the Wright Brothers, and Martin Luther King have one thing in common - they started with why. This book is for anyone who wants to inspire others, or to be inspired. www.startwithwhy.com Jacket design: Base Art Co.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dn00dkgEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Start with why",
      "wishlistDate": 1590164012247
    },
    {
      "author": "Matthew Walker",
      "currentPage": 360,
      "endDate": 1587445690655,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003d-fKlDgAAQBAJ\u0026source\u003dgbs_api",
      "id": 111,
      "isbn": "9780141983776",
      "labels": [
        {
          "bookId": 111,
          "hexColor": "#ff2196f3",
          "title": "Science"
        },
        {
          "bookId": 111,
          "hexColor": "#ff009688",
          "title": "Favorites"
        }
      ],
      "language": "en",
      "pageCount": 360,
      "position": 15,
      "publishedDate": "2017-09-28",
      "rating": 5,
      "startDate": 1586772000000,
      "state": "READ",
      "subTitle": "The New Science of Sleep and Dreams",
      "summary": "\u0027Astonishing ... an amazing book ... absolutely chocker full of things that we need to know\u0027 Chris Evans \u0027Matthew Walker is probably one of the most influential people on the planet\u0027 Evening Standard THE #1 SUNDAY TIMES BESTSELLER TLS, OBSERVER, SUNDAY TIMES, FT, GUARDIAN, DAILY MAIL AND EVENING STANDARD BOOKS OF THE YEAR 2017 Sleep is one of the most important aspects of our life, health and longevity and yet it is increasingly neglected in twenty-first-century society, with devastating consequences: every major disease in the developed world - Alzheimer\u0027s, cancer, obesity, diabetes - has very strong causal links to deficient sleep. In this book, the first of its kind written by a scientific expert, Professor Matthew Walker explores twenty years of cutting-edge research to solve the mystery of why sleep matters. Looking at creatures from across the animal kingdom as well as major human studies, Why We Sleep delves into everything from what really happens during REM sleep to how caffeine and alcohol affect sleep and why our sleep patterns change across a lifetime, transforming our appreciation of the extraordinary phenomenon that safeguards our existence. \u0027Startling, vital ... a life-raft\u0027 Guardian \u0027A top sleep scientist argues that sleep is more important for our health than diet or exercise\u0027 The Times \u0027Passionate, urgent . . . it had a powerful effect on me\u0027 Observer",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d-fKlDgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Why We Sleep",
      "wishlistDate": 1578654000000
    },
    {
      "author": "Daniel Klein",
      "currentPage": 164,
      "endDate": 1588006645684,
      "googleBooksLink": "http://books.google.at/books?id\u003dokaLDQAAQBAJ\u0026dq\u003d9780143126621\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 110,
      "isbn": "9780143126621",
      "labels": [
        {
          "bookId": 110,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        }
      ],
      "language": "en",
      "notes": "sehr unterhaltsam und kurzweilig geschrieben, aber auch tief philosophisch.\n\nFür mich die Variante von Zen \u0026 the art of motorcycle maintainance wie es sein sollte!",
      "pageCount": 164,
      "position": 19,
      "publishedDate": "2014-10-28",
      "rating": 4,
      "startDate": 1587500051089,
      "state": "READ",
      "subTitle": "A Journey to a Greek Island in Search of a Fulfilled Life",
      "summary": "Describes how the author journeyed to Greece with a suitcase full of philosophy books in order to learn how to achieve a fulfilling old age, explaining how he came to regard old age as a life stage filled with simple and heady pleasures.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dokaLDQAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Travels with Epicurus",
      "wishlistDate": 1586801933873
    },
    {
      "author": "Bodo Schäfer",
      "currentPage": 247,
      "endDate": 1585933364059,
      "googleBooksLink": "http://books.google.at/books?id\u003d8dJyAAAACAAJ\u0026dq\u003d9783423340489\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 109,
      "isbn": "9783423340489",
      "labels": [],
      "language": "de",
      "pageCount": 247,
      "position": 20,
      "publishedDate": "2003",
      "rating": 4,
      "startDate": 1585350000000,
      "state": "READ",
      "subTitle": "Erfolg und ein erfülltes Leben",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d8dJyAAAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Die Gesetze der Gewinner",
      "wishlistDate": 1583777139025
    },
    {
      "author": "Jordan B. Peterson",
      "currentPage": 477,
      "endDate": 1591246247489,
      "googleBooksLink": "http://books.google.at/books?id\u003dbXfzvAEACAAJ\u0026dq\u003d9780735278516\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 108,
      "isbn": "9780735278516",
      "labels": [
        {
          "bookId": 108,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        }
      ],
      "language": "en",
      "notes": "\n\n\"Thinking is listening to yourself\"\npage 286",
      "pageCount": 477,
      "position": 26,
      "publishedDate": "2019-04",
      "rating": 5,
      "startDate": 1590007293216,
      "state": "READ",
      "subTitle": "An Antidote to Chaos",
      "summary": "\"What does everyone in the modern world need to know? Renowned psychologist Jordan B. Peterson\u0027s answer to this most difficult of questions uniquely combines the hard-won truths of ancient tradition with the stunning revelations of cutting-edge scientific research. Humorous, surprising and informative, Dr. Peterson tells us why skateboarding boys and girls must be left alone, what terrible fate awaits those who criticize too easily, and why you should always pet a cat when you meet one on the street. What does the nervous system of the lowly lobster have to tell us about standing up straight (with our shoulders back) and about success in life? Why did ancient Egyptians worship the capacity to pay careful attention as the highest of gods? What dreadful paths do people tread when they become resentful, arrogant and vengeful? Dr. Peterson journeys broadly, discussing discipline, freedom, adventure and responsibility, distilling the world\u0027s wisdom into 12 practical and profound rules for life. 12 Rules for Life shatters the modern commonplaces of science, faith and human nature, while transforming and ennobling the mind and spirit of its readers.\"--",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dbXfzvAEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "12 Rules for Life",
      "wishlistDate": 1581158620677
    },
    {
      "author": "Enrique López Mañas",
      "currentPage": 500,
      "endDate": 1579501876870,
      "id": 107,
      "isbn": "9781942878827",
      "labels": [
        {
          "bookId": 107,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "pageCount": 500,
      "position": 21,
      "publishedDate": "2019",
      "rating": 3,
      "startDate": 1579034214817,
      "state": "READ",
      "subTitle": "REFLECT, REFACTOR \u0026 REFRESH",
      "summary": "",
      "thumbnailAddress": "https://firebasestorage.googleapis.com/v0/b/dante-166506.appspot.com/o/custom_images%2F5w6U2PlW2OhsWGaPspY7SwXQB2L2%2Fimage%3A6866?alt\u003dmedia\u0026token\u003dbf087b75-348d-46be-83c9-4c4733801275",
      "title": "Living by the Code",
      "wishlistDate": 1579021249736
    },
    {
      "author": "Tom Kelley",
      "currentPage": 306,
      "endDate": 1586785443170,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dcokcDAAAQBAJ\u0026source\u003dgbs_api",
      "id": 106,
      "isbn": "9781847656780",
      "labels": [
        {
          "bookId": 106,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "en",
      "pageCount": 306,
      "position": 22,
      "publishedDate": "2016-06-16",
      "rating": 3,
      "startDate": 1585984235047,
      "state": "READ",
      "subTitle": "Lessons in Creativity from IDEO, America\u0027s Leading Design Firm",
      "summary": "There isn\u0027t a business that doesn\u0027t want to be more creative in its thinking, products and processes. In The Art of Innovation, Tom Kelley, partner at the Silicon Valley-based firm IDEO, developer of hundreds of innovative products from the first commercial mouse to virtual reality headsets and the Palm hand-held, takes readers behind the scenes of this wildly imaginative company to reveal the strategies and secrets it uses to turn out hit after hit. Kelley shows how teams: -Research and immerse themselves in every possible aspect of a new product or service -Examine each product from the perspective of clients, consumers and other critical audiences -Brainstorm best when they are focussed, being physical and having fun The Art of Innovation will provide business leaders with the insights and tools they need to make their companies the leading-edge top-rated stars of their industries.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dcokcDAAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "The Art Of Innovation",
      "wishlistDate": 1579020609280
    },
    {
      "author": "Napoleon Hill",
      "currentPage": 320,
      "endDate": 1585288965293,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dNMVoDwAAQBAJ\u0026source\u003dgbs_api",
      "id": 105,
      "isbn": "9783960923121",
      "labels": [
        {
          "bookId": 105,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        },
        {
          "bookId": 105,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "de",
      "pageCount": 320,
      "position": 23,
      "publishedDate": "2018-08-24",
      "rating": 3,
      "startDate": 1583574827590,
      "state": "READ",
      "subTitle": "Die ungekürzte und unveränderte Originalausgabe von Denke nach und werde reich von 1937",
      "summary": "Mit über 60 Millionen verkauften Exemplaren gehört Napoleon Hills Denke nach und werde reich zu den erfolgreichsten Büchern aller Zeiten. Mehr als 20 Jahre interviewte der blutjunge Napoleon Hill mehr als 500 Millionäre, unter ihnen die mächtigsten und einflussreichsten Persönlichkeiten seiner Zeit wie Thomas Edison, Alexander Graham Bell, Henry Ford, John D. Rockefeller oder Theodore Roosevelt. Die Essenz seiner Studie ist in dieses Buch eingeflossen. Herausgekommen ist eine ebenso zeitlose wie überzeugende Anleitung für persönlichen Erfolg, in der Hill zeigt, wie man in nur 13 Schritten sein Leben verändern kann. Nun ist erstmals die vollständige und ungekürzte Ausgabe von 1937 auf Deutsch erhältlich - das womöglich wichtigste Finanzbuch, das jemals geschrieben wurde. Es ist an der Zeit, sich nicht mehr zu fragen, was Erfolg ausmacht – sondern es zu wissen.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dNMVoDwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Think and Grow Rich – Deutsche Ausgabe",
      "wishlistDate": 1579020517772
    },
    {
      "author": "Seneca",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003d5yW4oAEACAAJ\u0026dq\u003d9780141395852\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 104,
      "isbn": "9780141395852",
      "labels": [
        {
          "bookId": 104,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        },
        {
          "bookId": 104,
          "hexColor": "#ff3f51b5",
          "title": "Stoicism"
        }
      ],
      "language": "en",
      "pageCount": 309,
      "position": 8,
      "publishedDate": "2014-10-22",
      "rating": 0,
      "startDate": 0,
      "state": "READ_LATER",
      "subTitle": "",
      "summary": "Seeing self-possession as the key to an existence lived \u0027in accordance with nature\u0027, the Stoic philosophy called for the restraint of animal instincts and the importance of upright ethical ideals and virtuous living. Seneca\u0027s writings are a profound, powerfully moving and inspiring declaration of the dignity of the individual mind.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d5yW4oAEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Letters from a Stoic",
      "wishlistDate": 1579020505970
    },
    {
      "author": "Tim Ferriss",
      "currentPage": 674,
      "endDate": 1585032042651,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dD1OHDQAAQBAJ\u0026source\u003dgbs_api",
      "id": 103,
      "isbn": "9783960920335",
      "labels": [
        {
          "bookId": 103,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        },
        {
          "bookId": 103,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        }
      ],
      "language": "en",
      "pageCount": 674,
      "position": 27,
      "publishedDate": "2017-01-02",
      "rating": 4,
      "startDate": 1582405778512,
      "state": "READ",
      "subTitle": "Die Taktiken, Routinen und Gewohnheiten der Weltklasse-Performer, Ikonen und Milliardäre",
      "summary": "\"Ich habe dieses Buch, mein ultimatives Notizbuch voller nützlicher Werkzeuge, für mich selbst kreiert. Es hat mein Leben verändert und ich hoffe, dir wird es genauso helfen.\" TIM FERRISS \"In den letzten zwei Jahren habe ich beinahe 200 Weltklasse-Performer interviewt. Die Bandbreite der Gäste reicht von Stars (Jamie Foxx, Arnold Schwarzenegger) und Topathleten bis hin zu legendären Kommandanten von Spezialeinheiten und sogar Schwarzmarkt-Biochemikern. Viele meiner Gäste akzeptierten erstmals in ihrer Karriere ein Zwei-bis-drei-Stunden-Interview. Dieses Buch enthält unverzichtbare Tools, Taktiken und Insiderwissen, die anderswo nicht zu finden sind, außerdem neue Tipps von früheren Gästen und Lebensweisheiten neuer Gäste, die du noch nicht kennst.\" Was das Buch so außergewöhnlich macht, ist der unablässige Fokus auf leicht umsetzbare Details: - Was tun diese Titanen in den ersten 60 Minuten an jedem Morgen? - Wie sieht ihre Trainingsroutine aus und warum? - Welches Buch haben sie am häufigsten an andere Menschen verschenkt? - Was betrachten sie als die größten Zeitverschwender? - Welche Nahrungsergänzungsmittel nehmen sie täglich? \"Alles, was du auf diesen Seiten liest, habe ich in meinem Leben bereits auf die eine oder andere Weise angewandt. Ich habe Dutzende der dargestellten Taktiken bei kritischen Verhandlungen, in riskanter Umgebung oder bei großen Deals eingesetzt. Die Lektionen haben mir zu Millionen von Dollar verholfen und mich vor Jahren verschwendeter Bemühungen und Frustration bewahrt.\" TIM FERRISS",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dD1OHDQAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Tools of the Titans",
      "wishlistDate": 1579020488639
    },
    {
      "author": "Robert C. Martin",
      "currentPage": 205,
      "endDate": 1580713985803,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dQQ6vDwAAQBAJ\u0026source\u003dgbs_api",
      "id": 102,
      "isbn": "9780135781999",
      "labels": [
        {
          "bookId": 102,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "notes": "",
      "pageCount": 205,
      "position": 29,
      "publishedDate": "2019-09-12",
      "rating": 4,
      "startDate": 1579883316308,
      "state": "READ",
      "subTitle": "Back to Basics",
      "summary": "Agile Values and Principles for a New Generation “In the journey to all things Agile, Uncle Bob has been there, done that, and has the both the t-shirt and the scars to show for it. This delightful book is part history, part personal stories, and all wisdom. If you want to understand what Agile is and how it came to be, this is the book for you.” –Grady Booch “Bob’s frustration colors every sentence of Clean Agile, but it’s a justified frustration. What is in the world of Agile development is nothing compared to what could be. This book is Bob’s perspective on what to focus on to get to that ‘what could be.’ And he’s been there, so it’s worth listening.” –Kent Beck “It’s good to read Uncle Bob’s take on Agile. Whether just beginning, or a seasoned Agilista, you would do well to read this book. I agree with almost all of it. It’s just some of the parts make me realize my own shortcomings, dammit. It made me double-check our code coverage (85.09%).” –Jon Kern Nearly twenty years after the Agile Manifesto was first presented, the legendary Robert C. Martin (“Uncle Bob”) reintroduces Agile values and principles for a new generation–programmers and nonprogrammers alike. Martin, author of Clean Code and other highly influential software development guides, was there at Agile’s founding. Now, in Clean Agile: Back to Basics, he strips away misunderstandings and distractions that over the years have made it harder to use Agile than was originally intended. Martin describes what Agile is in no uncertain terms: a small discipline that helps small teams manage small projects . . . with huge implications because every big project is comprised of many small projects. Drawing on his fifty years’ experience with projects of every conceivable type, he shows how Agile can help you bring true professionalism to software development. Get back to the basics–what Agile is, was, and should always be Understand the origins, and proper practice, of SCRUM Master essential business-facing Agile practices, from small releases and acceptance tests to whole-team communication Explore Agile team members’ relationships with each other, and with their product Rediscover indispensable Agile technical practices: TDD, refactoring, simple design, and pair programming Understand the central roles values and craftsmanship play in your Agile team’s success If you want Agile’s true benefits, there are no shortcuts: You need to do Agile right. Clean Agile: Back to Basics will show you how, whether you’re a developer, tester, manager, project manager, or customer. Register your book for convenient access to downloads, updates, and/or corrections as they become available. See inside book for details.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dQQ6vDwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Clean Agile",
      "wishlistDate": 1579020393401
    },
    {
      "author": "Dale Carnegie",
      "currentPage": 276,
      "endDate": 1579879342223,
      "googleBooksLink": "http://books.google.at/books?id\u003dNi88SAAACAAJ\u0026dq\u003d9781439199190\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 100,
      "isbn": "9781439199190",
      "labels": [
        {
          "bookId": 100,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        },
        {
          "bookId": 100,
          "hexColor": "#ff009688",
          "title": "Favorites"
        }
      ],
      "language": "en",
      "pageCount": 276,
      "position": 34,
      "publishedDate": "2010",
      "rating": 5,
      "startDate": 1578671818169,
      "state": "READ",
      "subTitle": "",
      "summary": "\"One of the most groundbreaking guidebooks of all time ...\" -- Back cover.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dNi88SAAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "How to Win Friends and Influence People",
      "wishlistDate": 1578659037877
    },
    {
      "author": "Reinhard Thieler-Unge",
      "currentPage": 172,
      "endDate": 1578166856668,
      "googleBooksLink": "http://books.google.at/books?id\u003dvT_kxQEACAAJ\u0026dq\u003ddie%2Bstartup%2Bbibel\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 99,
      "isbn": "9783965830950",
      "labels": [
        {
          "bookId": 99,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "de",
      "pageCount": 172,
      "position": 30,
      "publishedDate": "2019",
      "rating": 2,
      "startDate": 1577295328816,
      "state": "READ",
      "subTitle": "Der praxisnahe Ratgeber für eine schnelle, sichere und erfolgreichen Existenzgründung!",
      "summary": "",
      "thumbnailAddress": "https://firebasestorage.googleapis.com/v0/b/dante-166506.appspot.com/o/custom_images%2F5w6U2PlW2OhsWGaPspY7SwXQB2L2%2Fimage%3A7120?alt\u003dmedia\u0026token\u003da0fd60e8-b49e-4957-a4de-5ab65a6615ee",
      "title": "Die Startup Bibel",
      "wishlistDate": 1577219796191
    },
    {
      "author": "John Jantsch",
      "currentPage": 387,
      "endDate": 1609391769909,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dzgW5DwAAQBAJ\u0026source\u003dgbs_api",
      "id": 98,
      "isbn": "9781119579755",
      "labels": [
        {
          "bookId": 98,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        },
        {
          "bookId": 98,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "en",
      "notes": "",
      "pageCount": 387,
      "position": 1,
      "publishedDate": "2019-10-23",
      "rating": 5,
      "startDate": 1577132965695,
      "state": "READ",
      "subTitle": "366 Daily Meditations to Feed Your Soul and Grow Your Business",
      "summary": "A guide for creating a deeper relationship with the entrepreneurial journey The Self-Reliant Entrepreneur offers overworked and harried entrepreneurs, and anyone who thinks like one, a much-needed guide for tapping into the wisdom that is most relevant to the entrepreneurial life. The book is filled with inspirational meditations that contain the thoughts and writings of notable American authors. Designed as a daily devotional, it is arranged in a calendar format, and features readings of transcendentalist literature and others. Each of The Self-Reliant Entrepreneur meditations is followed by a reflection and a challenging question from John Jantsch. He draws on his lifetime of experience as a successful coach for small business and startup leaders to offer an entrepreneurial context. Jantsch shows how entrepreneurs can learn to trust their ideas and overcome the doubt and fear of everyday challenges. The book contains: A unique guide to meditations, especially designed for entrepreneurs A range of topics such as self-awareness, trust, creativity, resilience, failure, growth, freedom, love, integrity, and passion An inspirational meditation for each day of the year. . . including leap year Reflections from John Jantsch, small business marketing expert and the author of the popular book Duct Tape Marketing Written for entrepreneurs, as well anyone seeking to find a deeper meaning in their work and life, The Self-Reliant Entrepreneur is a practical handbook for anyone seeking to embrace the practice of self-trust.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dzgW5DwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "The Self-Reliant Entrepreneur",
      "wishlistDate": 1576255882185
    },
    {
      "author": "Ryan Holiday",
      "currentPage": 111,
      "endDate": 1576562995678,
      "googleBooksLink": "http://books.google.at/books?id\u003diBzCoAEACAAJ\u0026dq\u003d9781781254363\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 97,
      "isbn": "9781781254363",
      "labels": [
        {
          "bookId": 97,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "en",
      "pageCount": 111,
      "position": 31,
      "publishedDate": "2014-10-02",
      "rating": 3,
      "startDate": 1576317263118,
      "state": "READ",
      "subTitle": "A Primer on the Future of PR, Marketing and Advertising",
      "summary": "Your new business went online yesterday and you\u0027ve got a marketing budget of zero. How are you supposed to create a movement around your product? How can you get to your first thousand - or million - customers? Starting from zero, it feels impossible. Enter the growth hacker. You may not have heard of growth hacking yet, but you\u0027ve certainly used the billion dollar brands built by it: Hotmail, AirBnB, Facebook, Dropbox, amongst many others. Growth hackers thrive on doing what traditional businessmen would consider impossible: creating something from nothing. They \u0027hack\u0027 their company\u0027s growth to create a narrative of sensational success, turning excited media, users and social media into a viral marketing force that will help their business grow exponentially. Silicon Valley has realized that growth hacking - not television commercials and billboards - is the successful start-up\u0027s secret weapon. Now growth hacker extraordinaire Ryan Holiday is ready to share his experience, teaching you how to harness the power of growth to propel you to success. Featuring insights from leading growth hackers, Growth Hacker Marketing is the essential guide to the revolutionary new approach to growing your business.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003diBzCoAEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Growth Hacker Marketing",
      "wishlistDate": 1576255870024
    },
    {
      "author": "Ryan Holiday",
      "currentPage": 224,
      "endDate": 1572844722686,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dbS5GDgAAQBAJ\u0026source\u003dgbs_api",
      "id": 96,
      "isbn": "9783451810954",
      "labels": [
        {
          "bookId": 96,
          "hexColor": "#ff3f51b5",
          "title": "Stoicism"
        },
        {
          "bookId": 96,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        },
        {
          "bookId": 96,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        }
      ],
      "language": "de",
      "pageCount": 224,
      "position": 32,
      "publishedDate": "2017-03-17",
      "rating": 4,
      "startDate": 1572301810149,
      "state": "READ",
      "subTitle": "Mit der Philosophie der Stoiker zum Triumph",
      "summary": "Die großen Frauen und Männer hatten weder außergewöhnlich viel Glück, Talent oder Erfahrung. Sie hatten lediglich das gleiche Motto: Was dir im Weg steht, wird dein Weg! Ryan Holiday, Marketing-Guru und Bestsellerautor, wendet die vergessene Erfolgsformel der antiken Philosophen auf die heutige Welt an und gibt konkrete Anleitung, wie wir unser Leben selbst erfolgreich gestalten können: Manage deine Wahrnehmung! Erkenne, welche Begebenheiten du verändern kannst! Lenke deine Handlungen auf ein Ziel! Und mache jedes Hindernis in deinem Weg zu einer Chance! Ein Buch, das die lebenspraktischen Erkenntnisse der Stoiker aus dem antiken Griechenland und Rom in die Gegenwart holt und damit auf sehr eingängige Weise zeigt, wie wir im Leben erfolgreich sein können! Mit vielen Beispielen aus der Welt der Philosophie, Literatur, Sport, Wirtschaft und Politik (Markus Aurelius, Demosthenes, Michel de Montaigne, John D. Rockefeller, Steve Jobs, Mahatma Ghandi, Barack Obama ...).",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dbS5GDgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Das Hindernis ist der Weg",
      "wishlistDate": 1571496020999
    },
    {
      "author": "John P. Strelecky",
      "currentPage": 126,
      "endDate": 1570822640735,
      "googleBooksLink": "http://books.google.at/books?id\u003d1g8NAQAACAAJ\u0026dq\u003ddas%2Bcafe%2Bam%2Brande%2Bder%2Bwelt\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 95,
      "isbn": "9783423209694",
      "labels": [],
      "language": "de",
      "pageCount": 126,
      "position": 35,
      "publishedDate": "2007",
      "rating": 3,
      "startDate": 1570743902732,
      "state": "READ",
      "subTitle": "eine Erzählung über den Sinn des Lebens",
      "summary": "Through a fictional account the author tells the story of John, who sets out on a vacation to escape from his unfulfilling life. A simple yet profound story that asks questions about the purpose of life and our role as individuals.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d1g8NAQAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Das Café am Rande der Welt",
      "wishlistDate": 0
    },
    {
      "author": "Ryan Holiday",
      "currentPage": 262,
      "endDate": 1570722982305,
      "googleBooksLink": "http://books.google.at/books?id\u003d916TDwAAQBAJ\u0026dq\u003d9781788162050\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 93,
      "isbn": "9781782835271",
      "labels": [
        {
          "bookId": 93,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        },
        {
          "bookId": 93,
          "hexColor": "#ff3f51b5",
          "title": "Stoicism"
        },
        {
          "bookId": 93,
          "hexColor": "#ff009688",
          "title": "Favorites"
        },
        {
          "bookId": 93,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        }
      ],
      "language": "en",
      "pageCount": 262,
      "position": 37,
      "publishedDate": "2019-10-01",
      "rating": 5,
      "startDate": 1569669411670,
      "state": "READ",
      "subTitle": "An Ancient Strategy for Modern Life",
      "summary": "\u0027Whether you are an athlete, an investor, a writer or an entrepreneur, this little but soulful book will open the door to a healthier, less anxious and more productive life and career.\u0027 - Arianna Huffington \u0027Ryan\u0027s trilogy of The Obstacle is the Way, Ego is the Enemy and Stillness is the Key are for sure must-reads.\u0027 Manu Ginobili, 4x NBA champion and Olympic Gold Medalist Throughout history, there\u0027s been one indelible quality that great leaders, makers, artists and fighters have shared. The Zen Buddhists described it as inner peace, the Stoics called it ataraxia and Ryan Holiday calls it stillness: the ability to be steady, focussed and calm in a constantly busy world. This quality, valued by every major school of thought from Buddha to Seneca, John Stuart Mill to Nietzsche, is urgently necessary today. And, Holiday shows, it is entirely attainable. Just as Winston Churchill used bricklaying as a time to recharge and reflect, or Oprah Winfrey learned deep empathy from her quiet childhood, we can all benefit from stillness to feed into our greater ambitions - whether winning a battle, building a business, or simply finding happiness, peace and self-direction. Filled with wisdom and examples from historical and contemporary figures, this book shows how to cultivate this quality in your own life. Because stillness is not merely inactivity, but the doorway to the self-mastery, discipline and focus necessary to succeed in this competitive, noisy world.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d916TDwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Stillness is the Key",
      "wishlistDate": 1569667678101
    },
    {
      "author": "Yuval Noah Harari",
      "currentPage": 432,
      "endDate": 1574145397144,
      "googleBooksLink": "http://books.google.at/books?id\u003dRYscvAEACAAJ\u0026dq\u003d9781784708283\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 92,
      "isbn": "9781784708283",
      "labels": [
        {
          "bookId": 92,
          "hexColor": "#ff2196f3",
          "title": "Science"
        }
      ],
      "language": "en",
      "pageCount": 432,
      "position": 38,
      "publishedDate": "2019-08",
      "rating": 5,
      "startDate": 1572993259599,
      "state": "READ",
      "subTitle": "",
      "summary": "Sapiens showed us where we came from. Homo Deus looked to the future. 21 Lessons for the 21st Century explores the present. How can we protect ourselves from nuclear war, ecological cataclysms and technological disruptions? What can we do about the epidemic of fake news or the threat of terrorism? What should we teach our children? Yuval Noah Harari takes us on a thrilling journey through today\u0027s most urgent issues. The golden thread running through his exhilarating new book is the challenge of maintaining our collective and individual focus in the face of constant and disorienting change. Are we still capable of understanding the world we have created?",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dRYscvAEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "21 Lessons for the 21st Century",
      "wishlistDate": 1567872298300
    },
    {
      "author": "Sam Newman",
      "currentPage": 256,
      "endDate": 1572981759177,
      "googleBooksLink": "http://books.google.at/books?id\u003djjl4BgAAQBAJ\u0026dq\u003d9781491950357\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 91,
      "isbn": "9781491950333",
      "labels": [
        {
          "bookId": 91,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "pageCount": 256,
      "position": 39,
      "publishedDate": "2015-02-02",
      "rating": 4,
      "startDate": 1566448750698,
      "state": "READ",
      "subTitle": "",
      "summary": "Annotation Over the past 10 years, distributed systems have become more fine-grained. From the large multi-million line long monolithic applications, we are now seeing the benefits of smaller self-contained services. Rather than heavy-weight, hard to change Service Oriented Architectures, we are now seeing systems consisting of collaborating microservices. Easier to change, deploy, and if required retire, organizations which are in the right position to take advantage of them are yielding significant benefits. This book takes an holistic view of the things you need to be cognizant of in order to pull this off. It covers just enough understanding of technology, architecture, operations and organization to show you how to move towards finer-grained systems.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003djjl4BgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Building Microservices",
      "wishlistDate": 1566406022120
    },
    {
      "author": "Peter Bruce, Andrew Bruce",
      "currentPage": 298,
      "endDate": 1600316866795,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dldPTDgAAQBAJ\u0026source\u003dgbs_api",
      "id": 90,
      "isbn": "9781491952917",
      "labels": [
        {
          "bookId": 90,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        },
        {
          "bookId": 90,
          "hexColor": "#ff2196f3",
          "title": "Science"
        }
      ],
      "language": "en",
      "pageCount": 298,
      "position": 13,
      "publishedDate": "2017-05-10",
      "rating": 3,
      "startDate": 1578517203364,
      "state": "READ",
      "subTitle": "50 Essential Concepts",
      "summary": "Statistical methods are a key part of of data science, yet very few data scientists have any formal statistics training. Courses and books on basic statistics rarely cover the topic from a data science perspective. This practical guide explains how to apply various statistical methods to data science, tells you how to avoid their misuse, and gives you advice on what\u0027s important and what\u0027s not. Many data science resources incorporate statistical methods but lack a deeper statistical perspective. If you’re familiar with the R programming language, and have some exposure to statistics, this quick reference bridges the gap in an accessible, readable format. With this book, you’ll learn: Why exploratory data analysis is a key preliminary step in data science How random sampling can reduce bias and yield a higher quality dataset, even with big data How the principles of experimental design yield definitive answers to questions How to use regression to estimate outcomes and detect anomalies Key classification techniques for predicting which categories a record belongs to Statistical machine learning methods that “learn” from data Unsupervised learning methods for extracting meaning from unlabeled data",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dldPTDgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Practical Statistics for Data Scientists",
      "wishlistDate": 1566405981464
    },
    {
      "author": "Martin Kleppmann",
      "currentPage": 590,
      "endDate": 1603790553260,
      "googleBooksLink": "http://books.google.at/books?id\u003dzFheDgAAQBAJ\u0026dq\u003d9781449373320\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 89,
      "isbn": "9781491903117",
      "labels": [
        {
          "bookId": 89,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "pageCount": 590,
      "position": 4,
      "publishedDate": "2017-03-16",
      "rating": 5,
      "startDate": 1600920931746,
      "state": "READ",
      "subTitle": "The Big Ideas Behind Reliable, Scalable, and Maintainable Systems",
      "summary": "Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and maintainability. In addition, we have an overwhelming variety of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive guide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications. Peer under the hood of the systems you already use, and learn how to use and operate them more effectively Make informed decisions by identifying the strengths and weaknesses of different tools Navigate the trade-offs around consistency, scalability, fault tolerance, and complexity Understand the distributed systems research upon which modern databases are built Peek behind the scenes of major online services, and learn from their architectures",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dzFheDgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Designing Data-Intensive Applications",
      "wishlistDate": 1566338400000
    },
    {
      "author": "Blake Masters, Peter Thiel",
      "currentPage": 224,
      "endDate": 1565391612213,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dM22fAwAAQBAJ\u0026source\u003dgbs_api",
      "id": 88,
      "isbn": "9780753550304",
      "labels": [
        {
          "bookId": 88,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "en",
      "pageCount": 224,
      "position": 76,
      "publishedDate": "2014-09-18",
      "rating": 5,
      "startDate": 1564858800000,
      "state": "READ",
      "subTitle": "Notes on Start Ups, or How to Build the Future",
      "summary": "WHAT VALUABLE COMPANY IS NOBODY BUILDING? The next Bill Gates will not build an operating system. The next Larry Page or Sergey Brin won’t make a search engine. If you are copying these guys, you aren’t learning from them. It’s easier to copy a model than to make something new: doing what we already know how to do takes the world from 1 to n, adding more of something familiar. Every new creation goes from 0 to 1. This book is about how to get there. ‘Peter Thiel has built multiple breakthrough companies, and Zero to One shows how.’ ELON MUSK, CEO of SpaceX and Tesla ‘This book delivers completely new and refreshing ideas on how to create value in the world.’ MARK ZUCKERBERG, CEO of Facebook ‘When a risk taker writes a book, read it. In the case of Peter Thiel, read it twice. Or, to be safe, three times. This is a classic.’ NASSIM NICHOLAS TALEB, author of The Black Swan",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dM22fAwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Zero to One",
      "wishlistDate": 1563487200000
    },
    {
      "author": "Mark Manson",
      "currentPage": 273,
      "endDate": 1566426577396,
      "googleBooksLink": "http://books.google.at/books?id\u003dR0P9vwEACAAJ\u0026dq\u003d9780062888464\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 87,
      "isbn": "9780062888464",
      "labels": [
        {
          "bookId": 87,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        }
      ],
      "language": "en",
      "pageCount": 273,
      "position": 40,
      "publishedDate": "2019-05-14",
      "rating": 4,
      "startDate": 1563487200000,
      "state": "READ",
      "subTitle": "A Book About Hope",
      "summary": "From the author of the international mega-bestseller The Subtle Art of Not Giving A F*ck comes a counterintuitive guide to the problems of hope. We live in an interesting time. Materially, everything is the best it’s ever been—we are freer, healthier and wealthier than any people in human history. Yet, somehow everything seems to be irreparably and horribly f*cked—the planet is warming, governments are failing, economies are collapsing, and everyone is perpetually offended on Twitter. At this moment in history, when we have access to technology, education and communication our ancestors couldn’t even dream of, so many of us come back to an overriding feeling of hopelessness. What’s going on? If anyone can put a name to our current malaise and help fix it, it’s Mark Manson. In 2016, Manson published The Subtle Art of Not Giving A F*ck, a book that brilliantly gave shape to the ever-present, low-level hum of anxiety that permeates modern living. He showed us that technology had made it too easy to care about the wrong things, that our culture had convinced us that the world owed us something when it didn’t—and worst of all, that our modern and maddening urge to always find happiness only served to make us unhappier. Instead, the “subtle art” of that title turned out to be a bold challenge: to choose your struggle; to narrow and focus and find the pain you want to sustain. The result was a book that became an international phenomenon, selling millions of copies worldwide while becoming the #1 bestseller in 13 different countries. Now, in Everthing Is F*cked, Manson turns his gaze from the inevitable flaws within each individual self to the endless calamities taking place in the world around us. Drawing from the pool of psychological research on these topics, as well as the timeless wisdom of philosophers such as Plato, Nietzsche, and Tom Waits, he dissects religion and politics and the uncomfortable ways they have come to resemble one another. He looks at our relationships with money, entertainment and the internet, and how too much of a good thing can psychologically eat us alive. He openly defies our definitions of faith, happiness, freedom—and even of hope itself. With his usual mix of erudition and where-the-f*ck-did-that-come-from humor, Manson takes us by the collar and challenges us to be more honest with ourselves and connected with the world in ways we probably haven’t considered before. It’s another counterintuitive romp through the pain in our hearts and the stress of our soul. One of the great modern writers has produced another book that will set the agenda for years to come.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dR0P9vwEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Everything Is F*cked",
      "wishlistDate": 1562172402551
    },
    {
      "author": "Yuval Noah Harari",
      "currentPage": 528,
      "endDate": 1566085420672,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003d2RhBAAAAQBAJ\u0026source\u003dgbs_api",
      "id": 86,
      "isbn": "9783641104986",
      "labels": [
        {
          "bookId": 86,
          "hexColor": "#fff44336",
          "title": "History"
        },
        {
          "bookId": 86,
          "hexColor": "#ff2196f3",
          "title": "Science"
        }
      ],
      "language": "de",
      "pageCount": 528,
      "position": 83,
      "publishedDate": "2013-09-02",
      "rating": 5,
      "startDate": 1565420400000,
      "state": "READ",
      "subTitle": "",
      "summary": "Krone der Schöpfung? Vor 100 000 Jahren war der Homo sapiens noch ein unbedeutendes Tier, das unauffällig in einem abgelegenen Winkel des afrikanischen Kontinents lebte. Unsere Vorfahren teilten sich den Planeten mit mindestens fünf weiteren menschlichen Spezies, und die Rolle, die sie im Ökosystem spielten, war nicht größer als die von Gorillas, Libellen oder Quallen. Vor 70 000 Jahren dann vollzog sich ein mysteriöser und rascher Wandel mit dem Homo sapiens, und es war vor allem die Beschaffenheit seines Gehirns, die ihn zum Herren des Planeten und zum Schrecken des Ökosystems werden ließ. Bis heute hat sich diese Vorherrschaft stetig zugespitzt: Der Mensch hat die Fähigkeit zu schöpferischem und zu zerstörerischem Handeln wie kein anderes Lebewesen. Anschaulich, unterhaltsam und stellenweise hochkomisch zeichnet Yuval Harari die Geschichte des Menschen nach und zeigt alle großen, aber auch alle ambivalenten Momente unserer Menschwerdung.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d2RhBAAAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Eine kurze Geschichte der Menschheit",
      "wishlistDate": 1561809954591
    },
    {
      "author": "Ferdinand von Schirach",
      "currentPage": 195,
      "endDate": 1562107038889,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dLfgRDgAAQBAJ\u0026source\u003dgbs_api",
      "id": 85,
      "isbn": "9783641203252",
      "labels": [],
      "language": "de",
      "pageCount": 195,
      "position": 41,
      "publishedDate": "2017-02-13",
      "rating": 5,
      "startDate": 1561961472710,
      "state": "READ",
      "subTitle": "Roman",
      "summary": "Was treibt einen Menschen, der sich ein Leben lang nichts hat zuschulden kommen lassen, zu einem Mord? Vierunddreißig Jahre hat Fabrizio Collini als Werkzeugmacher bei Mercedes gearbeitet. Unauffällig und unbescholten. Und dann tötet er in einem Berliner Luxushotel einen alten Mann. Grundlos, wie es aussieht. Ein Albtraum für den jungen Anwalt Caspar Leinen, der die Pflichtverteidigung übernimmt: Das Opfer, ein hoch angesehener deutscher Industrieller, ist der Großvater seines besten Freundes. Schlimmer noch, Fabrizio Collini schweigt beharrlich zu seinem Motiv. Leinen beginnt zu recherchieren und stößt auf eine Spur, die ihn mitten hineinführt in ein erschreckendes Kapitel deutscher Justizgeschichte.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dLfgRDgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Der Fall Collini",
      "wishlistDate": 1561809932281
    },
    {
      "author": "Robert Greene",
      "currentPage": 222,
      "endDate": 1564570095791,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dOpUxBgAAQBAJ\u0026source\u003dgbs_api",
      "id": 84,
      "isbn": "9783446436428",
      "labels": [
        {
          "bookId": 84,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        },
        {
          "bookId": 84,
          "hexColor": "#fff44336",
          "title": "History"
        }
      ],
      "language": "de",
      "pageCount": 222,
      "position": 42,
      "publishedDate": "2015-02-02",
      "rating": 3,
      "startDate": 1562536800000,
      "state": "READ",
      "subTitle": "Kompaktausgabe",
      "summary": "In diesem Buch spannt Robert Greene einen weiten Bogen und stellt uns die Großmeister der Strategie vor, von Sunzi bis Churchill, von Hannibal über Friedrich den Großen bis Napoleon. Von ihren großen Erfolgen, aber auch von ihren Fehlern kann jeder lernen, denn strategisches Denken braucht man überall: in Wirtschaft und Politik, im Beruf wie im Privatleben. Die \"33 Gesetze der Strategie\" des Bestsellerautors Robert Greene erstmals auf Deutsch: knapp, prägnant, unterhaltsam.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dOpUxBgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "33 Gesetze der Strategie",
      "wishlistDate": 1561384099238
    },
    {
      "author": "Robert Greene",
      "currentPage": 256,
      "endDate": 1572170996109,
      "googleBooksLink": "http://books.google.at/books?id\u003d7ldKrgEACAAJ\u0026dq\u003d9783423348737\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 83,
      "isbn": "9783423348737",
      "labels": [],
      "language": "de",
      "pageCount": 256,
      "position": 77,
      "publishedDate": "2016-02",
      "rating": 4,
      "startDate": 1571171311369,
      "state": "READ",
      "subTitle": "Die 48 Gesetze der Macht Kompaktausgabe",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d7ldKrgEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Power",
      "wishlistDate": 1561327200000
    },
    {
      "author": "Luciano De Crescenzo",
      "currentPage": 550,
      "endDate": 1589099841945,
      "googleBooksLink": "http://books.google.at/books?id\u003dguvvAAAACAAJ\u0026dq\u003dGeschichte%2Bder%2Bgriechischen%2Bphilosophie%2Bcrescenzo\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 82,
      "isbn": "9783257061659",
      "labels": [
        {
          "bookId": 82,
          "hexColor": "#fff44336",
          "title": "History"
        },
        {
          "bookId": 82,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        }
      ],
      "language": "de",
      "pageCount": 550,
      "position": 24,
      "publishedDate": "1998",
      "rating": 4,
      "startDate": 1588046369606,
      "state": "READ",
      "subTitle": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dguvvAAAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Geschichte der griechischen Philosophie",
      "wishlistDate": 1561383769463
    },
    {
      "author": "Reinhold Mitterlehner",
      "currentPage": 203,
      "endDate": 1561916168882,
      "googleBooksLink": "http://books.google.at/books?id\u003dPuhcvgEACAAJ\u0026dq\u003d9783711002396\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 81,
      "isbn": "9783711002396",
      "labels": [],
      "language": "de",
      "pageCount": 203,
      "position": 43,
      "publishedDate": "2019-04-18",
      "rating": 5,
      "startDate": 1561725542727,
      "state": "READ",
      "subTitle": "Werte in der Politik und im Leben",
      "summary": "",
      "thumbnailAddress": "https://firebasestorage.googleapis.com/v0/b/dante-166506.appspot.com/o/custom_images%2F5w6U2PlW2OhsWGaPspY7SwXQB2L2%2Fimage%3A6867?alt\u003dmedia\u0026token\u003d80612605-6104-4e04-9dfb-8b4e0bc6ffca",
      "title": "Haltung",
      "wishlistDate": 1561383482850
    },
    {
      "author": "E.M. Remarque",
      "currentPage": 79,
      "endDate": 1564089379718,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003d5DraAgAAQBAJ\u0026source\u003dgbs_api",
      "id": 80,
      "isbn": "9783462308143",
      "labels": [],
      "language": "de",
      "pageCount": 128,
      "position": 78,
      "publishedDate": "2014-03-08",
      "rating": 4,
      "startDate": 1562708171949,
      "state": "READ",
      "subTitle": "Sämtliche Erzählungen zum Ersten Weltkrieg",
      "summary": "Zum hundertsten Jahrestag des Kriegsbeginns 1914: sämtliche Werke von Erich Maria Remarque zum Ersten Weltkrieg, durchgesehen und in neuer Ausstattung. Sämtliche Erzählungen über die Schicksale von Menschen, die der Hölle der Schützengräben entronnen sind und sich in der Normalität des Nachkriegsalltags zurechtfinden müssen. »Handlungsraffung, Aktion, schnörkelloser Bericht und die Witterung fürs Sensationelle – alles dies macht die Erzählungen zur spannend-unterhaltsamen, die pazifistische Botschaft nie aufdrängenden Prosa.« FAZ",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d5DraAgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Der Feind",
      "wishlistDate": 1561383354287
    },
    {
      "author": "Charles Petzold",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003dLFQ7DwAAQBAJ\u0026dq\u003d9780470229057\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 79,
      "isbn": "9780470229057",
      "labels": [
        {
          "bookId": 79,
          "hexColor": "#ff2196f3",
          "title": "Science"
        },
        {
          "bookId": 79,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "pageCount": 372,
      "position": 9,
      "publishedDate": "2008-06-16",
      "rating": 0,
      "startDate": 0,
      "state": "READ_LATER",
      "subTitle": "A Guided Tour Through Alan Turing\u0027s Historic Paper on Computability and the Turing Machine",
      "summary": "Provides an expansion of Turing\u0027s original paper, a brief look at his life, and information on the Turing machine and computability topics.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dLFQ7DwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "The Annotated Turing",
      "wishlistDate": 1560333600000
    },
    {
      "author": "Ralph Johnson, Erich Gamma, John Vlissides, Richard Helm",
      "currentPage": 395,
      "endDate": 1582354072486,
      "googleBooksLink": "http://books.google.at/books?id\u003dMkn6uAEACAAJ\u0026dq\u003d9780201633610\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 78,
      "isbn": "9780201633610",
      "labels": [
        {
          "bookId": 78,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "pageCount": 395,
      "position": 28,
      "publishedDate": "1995",
      "rating": 0,
      "startDate": 1574525484906,
      "state": "READ",
      "subTitle": "Elements of Reusable Object-Oriented Software",
      "summary": "Capturing a wealth of experience about the design of object-oriented software, four top-notch designers present a catalog of simple and succinct solutions to commonly occurring design problems. Previously undocumented, these 23 patterns allow designers to create more flexible, elegant, and ultimately reusable designs without having to rediscover the design solutions themselves. The authors begin by describing what patterns are and how they can help you design object-oriented software. They then go on to systematically name, explain, evaluate, and catalog recurring designs in object-oriented systems. With Design Patterns as your guide, you will learn how these important patterns fit into the software development process, and how you can leverage them to solve your own design problems most efficiently. Each pattern describes the circumstances in which it is applicable, when it can be applied in view of other design constraints, and the consequences and trade-offs of using the pattern within a larger design. All patterns are compiled from real systems and are based on real-world examples. Each pattern also includes code that demonstrates how it may be implemented in object-oriented programming languages like C++ or Smalltalk.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dMkn6uAEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Design Patterns",
      "wishlistDate": 1559367698532
    },
    {
      "author": "Robert Greene",
      "currentPage": 588,
      "endDate": 1576011905746,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003d0U5XDwAAQBAJ\u0026source\u003dgbs_api",
      "id": 77,
      "isbn": "9781782833888",
      "labels": [
        {
          "bookId": 77,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        },
        {
          "bookId": 77,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        }
      ],
      "language": "en",
      "pageCount": 588,
      "position": 33,
      "publishedDate": "2018-10-25",
      "rating": 5,
      "startDate": 1560365170252,
      "state": "READ",
      "subTitle": "",
      "summary": "From the million-copy bestselling author of The 48 Laws of Power Robert Greene is a master guide for millions of readers, distilling ancient wisdom and philosophy into essential texts for seekers of power, understanding and mastery. Now he turns to the most important subject of all - understanding people\u0027s drives and motivations, even when they are unconscious of them themselves. We are social animals. Our very lives depend on our relationships with people. Knowing why people do what they do is the most important tool we can possess, without which our other talents can only take us so far. Drawing from the ideas and examples of Pericles, Queen Elizabeth I, Martin Luther King Jr, and many others, Greene teaches us how to detach ourselves from our own emotions and master self-control, how to develop the empathy that leads to insight, how to look behind people\u0027s masks, and how to resist conformity to develop your singular sense of purpose. Whether at work, in relationships, or in shaping the world around you, The Laws of Human Nature offers brilliant tactics for success, self-improvement, and self-defence.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d0U5XDwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "The Laws of Human Nature",
      "wishlistDate": 1555365600000
    },
    {
      "author": "Jake Knapp, John Zeratsky, Braden Kowitz",
      "currentPage": 274,
      "endDate": 1557645815587,
      "googleBooksLink": "http://books.google.at/books?id\u003dBWlJjgEACAAJ\u0026dq\u003d9781501140808\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 75,
      "isbn": "9781501140808",
      "labels": [
        {
          "bookId": 75,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "en",
      "pageCount": 274,
      "position": 44,
      "publishedDate": "2016-03-08",
      "rating": 0,
      "startDate": 1556659213671,
      "state": "READ",
      "subTitle": "How to Solve Big Problems and Test New Ideas in Just 5 Days",
      "summary": "Entrepreneurs and leaders face big questions every day: What\u0027s the most important place to focus your effort, and how do you start? What will your idea look like in real life? How many meetings and discussions does it take before you can be sure you have the right solution? Now there\u0027s a surefire way to answer these important questions: the sprint. Designer Jake Knapp created the five-day process at Google, where sprints were used on everything from Google Search to Google X. He joined Braden Kowitz and John Zeratsky at Google Ventures, and together they have completed more than a hundred sprints with companies in mobile, e-commerce, health care, finance and more. A practical guide to answering critical business questions, Sprint is a book for terms of any size or kind, from small startups to Fortune 100s, from teachers to nonprofits, it\u0027s for anyone with a big opportunity, problem, or idea who needs to get answers today. Book jacket.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dBWlJjgEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Sprint",
      "wishlistDate": 1555418620018
    },
    {
      "author": "Niccolò Machiavelli",
      "currentPage": 165,
      "endDate": 1556977312395,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003d_lx4DwAAQBAJ\u0026source\u003dgbs_api",
      "id": 74,
      "isbn": "9783843804103",
      "labels": [
        {
          "bookId": 74,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 165,
      "position": 45,
      "publishedDate": "2013-08-20",
      "rating": 4,
      "startDate": 1556476699608,
      "state": "READ",
      "subTitle": "Neu übsetzt und mit einleitendem Vorwort von Raphael Arnold",
      "summary": "Für die klassischen Fragen der politischen Philosophie interessierte sich Machiavelli weniger. Anstatt über ideale Staatsgebilde zu spekulieren oder nach dem Urzustand des Menschen zu fragen, beschäftigte er sich lieber mit den Fakten politischer Macht. Der Fürst ist vordergründig ein Lehrbuch der sogenannten Realpolitik, des Machterhalts und dessen, was man heute public relations nennen würde. Und obwohl Machiavelli vielen als der Teufel schlechthin gilt und sein Name in der Psychologie synonym mit einer kalten, berechnenden Intelligenz geworden ist, ist die Auseinandersetzung mit Machiavellis ehrlicher Analyse der Herrschaft ein Muss. Dazu bietet diese Neuübersetzung Gelegenheit.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d_lx4DwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Der Fürst",
      "wishlistDate": 1549731032605
    },
    {
      "author": "Tilman Santarius, Steffen Lange",
      "currentPage": 186,
      "endDate": 1561439326181,
      "googleBooksLink": "http://books.google.at/books?id\u003dUNKiswEACAAJ\u0026dq\u003d9783962380205\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 73,
      "isbn": "9783962380205",
      "labels": [],
      "language": "de",
      "pageCount": 265,
      "position": 46,
      "publishedDate": "2018-03",
      "rating": 2,
      "startDate": 1560698290480,
      "state": "READ",
      "subTitle": "Digitalisierung zwischen Überwachung, Konsum und Nachhaltigkeit",
      "summary": "",
      "thumbnailAddress": "https://firebasestorage.googleapis.com/v0/b/dante-166506.appspot.com/o/custom_images%2F5w6U2PlW2OhsWGaPspY7SwXQB2L2%2Fimage%3A7000?alt\u003dmedia\u0026token\u003dadd9ae85-4e56-44c8-a2ae-33a19dd59929",
      "title": "Smarte grüne Welt?",
      "wishlistDate": 1549730957811
    },
    {
      "author": "Marc Aurel",
      "currentPage": 193,
      "endDate": 1600855446501,
      "googleBooksLink": "http://books.google.at/books?id\u003dBYKMAAAACAAJ\u0026dq\u003d9783458357278\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 71,
      "isbn": "9783458357278",
      "labels": [
        {
          "bookId": 71,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        },
        {
          "bookId": 71,
          "hexColor": "#ff3f51b5",
          "title": "Stoicism"
        }
      ],
      "language": "de",
      "pageCount": 193,
      "position": 10,
      "publishedDate": "2011",
      "rating": 0,
      "startDate": 1598897086595,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "https://books.google.com/books/content?id\u003dBYKMAAAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Wege zu sich selbst",
      "wishlistDate": 1549730857529
    },
    {
      "author": "Joshua Bloch",
      "currentPage": 392,
      "endDate": 1551683412922,
      "googleBooksLink": "http://books.google.at/books?id\u003d1cVqswEACAAJ\u0026dq\u003d9780134685991\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 70,
      "isbn": "9780134685991",
      "labels": [
        {
          "bookId": 70,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "pageCount": 392,
      "position": 47,
      "publishedDate": "2018",
      "rating": 5,
      "startDate": 1547982164329,
      "state": "READ",
      "subTitle": "",
      "summary": "Since this Jolt-award winning classic was last updated in 2008 (shortly after Java 6 was released), Java has changed dramatically. In this new edition, Bloch updates the work to take advantage of Java\u0027s new language and library features, and provides specific best practices for their use. (Computers - Languages/Programming)",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d1cVqswEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Effective Java",
      "wishlistDate": 1547743150330
    },
    {
      "author": "Robert C. Martin",
      "currentPage": 411,
      "endDate": 1562219368218,
      "googleBooksLink": "http://books.google.at/books?id\u003d7pVbAgAAQBAJ\u0026dq\u003d9780132350884\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 69,
      "isbn": "9783826696381",
      "labels": [
        {
          "bookId": 69,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "de",
      "pageCount": 411,
      "position": 48,
      "publishedDate": "2013-12-18",
      "rating": 5,
      "startDate": 1553874697483,
      "state": "READ",
      "subTitle": "Deutsche Ausgabe",
      "summary": "h2\u003e Kommentare, Formatierung, Strukturierung Fehler-Handling und Unit-Tests Zahlreiche Fallstudien, Best Practices, Heuristiken und Code Smells Clean Code - Refactoring, Patterns, Testen und Techniken für sauberen Code Aus dem Inhalt: Lernen Sie, guten Code von schlechtem zu unterscheiden Sauberen Code schreiben und schlechten Code in guten umwandeln Aussagekräftige Namen sowie gute Funktionen, Objekte und Klassen erstellen Code so formatieren, strukturieren und kommentieren, dass er bestmöglich lesbar ist Ein vollständiges Fehler-Handling implementieren, ohne die Logik des Codes zu verschleiern Unit-Tests schreiben und Ihren Code testgesteuert entwickeln Selbst schlechter Code kann funktionieren. Aber wenn der Code nicht sauber ist, kann er ein Entwicklungsunternehmen in die Knie zwingen. Jedes Jahr gehen unzählige Stunden und beträchtliche Ressourcen verloren, weil Code schlecht geschrieben ist. Aber das muss nicht sein. Mit Clean Code präsentiert Ihnen der bekannte Software-Experte Robert C. Martin ein revolutionäres Paradigma, mit dem er Ihnen aufzeigt, wie Sie guten Code schreiben und schlechten Code überarbeiten. Zusammen mit seinen Kollegen von Object Mentor destilliert er die besten Praktiken der agilen Entwicklung von sauberem Code zu einem einzigartigen Buch. So können Sie sich die Erfahrungswerte der Meister der Software-Entwicklung aneignen, die aus Ihnen einen besseren Programmierer machen werden – anhand konkreter Fallstudien, die im Buch detailliert durchgearbeitet werden. Sie werden in diesem Buch sehr viel Code lesen. Und Sie werden aufgefordert, darüber nachzudenken, was an diesem Code richtig und falsch ist. Noch wichtiger: Sie werden herausgefordert, Ihre professionellen Werte und Ihre Einstellung zu Ihrem Beruf zu überprüfen. Clean Code besteht aus drei Teilen:Der erste Teil beschreibt die Prinzipien, Patterns und Techniken, die zum Schreiben von sauberem Code benötigt werden. Der zweite Teil besteht aus mehreren, zunehmend komplexeren Fallstudien. An jeder Fallstudie wird aufgezeigt, wie Code gesäubert wird – wie eine mit Problemen behaftete Code-Basis in eine solide und effiziente Form umgewandelt wird. Der dritte Teil enthält den Ertrag und den Lohn der praktischen Arbeit: ein umfangreiches Kapitel mit Best Practices, Heuristiken und Code Smells, die bei der Erstellung der Fallstudien zusammengetragen wurden. Das Ergebnis ist eine Wissensbasis, die beschreibt, wie wir denken, wenn wir Code schreiben, lesen und säubern. Dieses Buch ist ein Muss für alle Entwickler, Software-Ingenieure, Projektmanager, Team-Leiter oder Systemanalytiker, die daran interessiert sind, besseren Code zu produzieren. Über den Autor: Robert C. »Uncle Bob« Martin entwickelt seit 1970 professionell Software. Seit 1990 arbeitet er international als Software-Berater. Er ist Gründer und Vorsitzender von Object Mentor, Inc., einem Team erfahrener Berater, die Kunden auf der ganzen Welt bei der Programmierung in und mit C++, Java, C#, Ruby, OO, Design Patterns, UML sowie Agilen Methoden und eXtreme Programming helfen.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d7pVbAgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Clean Code - Refactoring, Patterns, Testen und Techniken für sauberen Code",
      "wishlistDate": 1547743131687
    },
    {
      "author": "Nikolaj V. Gogol",
      "currentPage": 182,
      "endDate": 1558677043603,
      "googleBooksLink": "http://books.google.at/books?id\u003dc97ZAAAACAAJ\u0026dq\u003d9783458332138\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 68,
      "isbn": "9783458332138",
      "labels": [],
      "language": "de",
      "pageCount": 182,
      "position": 49,
      "publishedDate": "1993",
      "rating": 4,
      "startDate": 1557984047103,
      "state": "READ",
      "subTitle": "Erzählungen",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dc97ZAAAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Aufzeichnungen eines Wahnsinnigen",
      "wishlistDate": 1547743116657
    },
    {
      "author": "Roald Dahl",
      "currentPage": 158,
      "endDate": 1550436283140,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dIRSZAgAAQBAJ\u0026source\u003dgbs_api",
      "id": 67,
      "isbn": "9783644040311",
      "labels": [],
      "language": "de",
      "pageCount": 192,
      "position": 79,
      "publishedDate": "2014-02-01",
      "rating": 4,
      "startDate": 1549994412049,
      "state": "READ",
      "subTitle": "Vier erotische Überraschungen",
      "summary": "Wenn Onkel Oswald Skorpione, Spazierstöcke und schöne Mädchen sammelt, ein Duftwasser mit betörender Wunderwirkung mischen lässt oder ein leidenschaftlicher Vorort-Casanova ein neuartiges System des Partnertausches ersinnt: «Stets stellen sich beim Lesen die angenehmsten Schauder ein.» (Stern) Wie bei «Küßchen,Küßchen!»: Beim Meister des Makabren ist schaurig-schönes Gruseln garantiert.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dIRSZAgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Kuschelmuschel",
      "wishlistDate": 1547743099528
    },
    {
      "author": "Lasse Koskela",
      "currentPage": 513,
      "endDate": 1606943884394,
      "googleBooksLink": "http://books.google.at/books?id\u003d_nQMGQAACAAJ\u0026dq\u003d9781932394856\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 66,
      "isbn": "9781932394856",
      "labels": [
        {
          "bookId": 66,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "pageCount": 513,
      "position": 0,
      "publishedDate": "2008",
      "rating": 4,
      "startDate": 1605726921182,
      "state": "READ",
      "subTitle": "Practical TDD and Acceptance TDD for Java Developers",
      "summary": "Describes the techniques, tools, and design patterns of TDD and ATDD and how to test Java code and Java EE components.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d_nQMGQAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Test Driven",
      "wishlistDate": 1547673577184
    },
    {
      "author": "Stephen W. Hawking",
      "currentPage": 271,
      "endDate": 1604250869013,
      "googleBooksLink": "http://books.google.at/books?id\u003dNk_PpwAACAAJ\u0026dq\u003d9783499626005\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 65,
      "isbn": "9783499626005",
      "labels": [
        {
          "bookId": 65,
          "hexColor": "#ff2196f3",
          "title": "Science"
        }
      ],
      "language": "de",
      "pageCount": 271,
      "position": 5,
      "publishedDate": "2011",
      "rating": 3,
      "startDate": 1601930437904,
      "state": "READ",
      "subTitle": "",
      "summary": "Zehn Jahre sind seit der Erstveröffentlichung des internationalen Bestsellers vergangen, eine Zeit, in der die Erforschung des Universums und der Teilchenwelt um Riesenschritte vorangekommen ist. Sie haben zu einer Fülle neuer Beobachtungsdaten und zu enormen Fortschritten bei der Suche nach der Großen Vereinheitlichten Theorie geführt, die alle Rätsel um Entstehung, Entwicklung und Zukunft des Weltalls lösen soll. In dieser aktualisierten und erweiterten Ausgabe bringt Hawking sein Buch auf den aktuellen Erkenntnisstand. Der Band enthält neben dem vollständig überarbeiteten Originaltext ein neues Vorwort und ein zusätzliches Kapitel über Wurmlöcher und Zeitreisen. Das Buch, das unsere Weltsicht verändert hat Woher kommen wir? Warum ist das Universum so, wie es ist? Dieses Buch hat unsere Weltsicht verändert und zugleich setzte es neue Maßstäbe für die Darstellung komplexer physikalischer Zusammenhänge. Stephen Hawkings \"Eine kurze Geschichte der Zeit\" hat das Wissen über die Entstehung des Universums, Schwarze Löcher, das Wesen der Zeit und die Suche nach der Weltformel in der Physik und Kosmologie populär gemacht wie kein anderes. Das Credo eines Jahrhundert-Genies.",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dNk_PpwAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Eine kurze Geschichte der Zeit",
      "wishlistDate": 1547665499565
    },
    {
      "author": "Robert M. Pirsig",
      "currentPage": 540,
      "endDate": 1556316000000,
      "googleBooksLink": "http://books.google.at/books?id\u003dKMRReyLPyXMC\u0026dq\u003d9780060589462\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 63,
      "isbn": "9780060589462",
      "labels": [
        {
          "bookId": 63,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        }
      ],
      "language": "en",
      "pageCount": 540,
      "position": 50,
      "publishedDate": "2006-04-25",
      "rating": 4,
      "startDate": 1542925414232,
      "state": "READ",
      "subTitle": "An Inquiry Into Values",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dKMRReyLPyXMC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Zen and the Art of Motorcycle Maintenance",
      "wishlistDate": 1540461600000
    },
    {
      "author": "Duncan Clark",
      "currentPage": 287,
      "endDate": 1559885036665,
      "googleBooksLink": "http://books.google.at/books?id\u003dbRn2DAEACAAJ\u0026dq\u003d9780062413413\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 62,
      "isbn": "9780062413413",
      "labels": [
        {
          "bookId": 62,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "en",
      "pageCount": 287,
      "position": 86,
      "publishedDate": "2017-04-11",
      "rating": 4,
      "startDate": 1557984076219,
      "state": "READ",
      "subTitle": "The House That Jack Ma Built",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dbRn2DAEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Alibaba",
      "wishlistDate": 1540463815360
    },
    {
      "author": "Ferdinand von Schirach",
      "currentPage": 137,
      "endDate": 1539027320686,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dhxw-DwAAQBAJ\u0026source\u003dgbs_api",
      "id": 61,
      "isbn": "9783641203412",
      "labels": [],
      "language": "de",
      "pageCount": 192,
      "position": 51,
      "publishedDate": "2018-03-05",
      "rating": 4,
      "startDate": 1538420808662,
      "state": "READ",
      "subTitle": "Stories",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dhxw-DwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Strafe",
      "wishlistDate": 1538309594595
    },
    {
      "author": "Ian Kershaw",
      "currentPage": 768,
      "endDate": 1599296501976,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dq8U2DAAAQBAJ\u0026source\u003dgbs_api",
      "id": 60,
      "isbn": "9783641188726",
      "labels": [
        {
          "bookId": 60,
          "hexColor": "#fff44336",
          "title": "History"
        }
      ],
      "language": "de",
      "pageCount": 768,
      "position": 6,
      "publishedDate": "2016-09-12",
      "rating": 4,
      "startDate": 1597988877438,
      "state": "READ",
      "subTitle": "Europa 1914 bis 1949",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dq8U2DAAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Höllensturz",
      "wishlistDate": 1538309532867
    },
    {
      "author": "Yuval Noah Harari",
      "currentPage": 608,
      "endDate": 1548787241199,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dIIjpDQAAQBAJ\u0026source\u003dgbs_api",
      "id": 59,
      "isbn": "9783406704024",
      "labels": [
        {
          "bookId": 59,
          "hexColor": "#ff2196f3",
          "title": "Science"
        }
      ],
      "language": "de",
      "pageCount": 608,
      "position": 52,
      "publishedDate": "2017-02-16",
      "rating": 5,
      "startDate": 1547072624557,
      "state": "READ",
      "subTitle": "Eine Geschichte von Morgen",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dIIjpDQAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Homo Deus",
      "wishlistDate": 1538309476210
    },
    {
      "author": "Harper Lee",
      "currentPage": 309,
      "endDate": 1568955847385,
      "googleBooksLink": "http://books.google.at/books?id\u003dst6EqikLVKoC\u0026dq\u003d9780099549482\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 58,
      "isbn": "9780099549482",
      "labels": [
        {
          "bookId": 58,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "en",
      "pageCount": 309,
      "position": 53,
      "publishedDate": "2010-06-01",
      "rating": 3,
      "startDate": 1566068400000,
      "state": "READ",
      "subTitle": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dst6EqikLVKoC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "To Kill a Mockingbird",
      "wishlistDate": 1538309415546
    },
    {
      "author": "Thomas Brezina",
      "currentPage": 89,
      "endDate": 1541719002585,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003d23JvDwAAQBAJ\u0026source\u003dgbs_api",
      "id": 57,
      "isbn": "9783711052452",
      "labels": [],
      "language": "de",
      "pageCount": 400,
      "position": 54,
      "publishedDate": "2018-09-20",
      "rating": 3,
      "startDate": 1538336920593,
      "state": "READ",
      "subTitle": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d23JvDwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Knickerbocker4immer - Schatten der Zukunft",
      "wishlistDate": 1538309388719
    },
    {
      "author": "Eric Ries",
      "currentPage": 255,
      "endDate": 1543446681042,
      "googleBooksLink": "http://books.google.at/books?id\u003d-KGEUgiRZj0C\u0026dq\u003dlean%2Bstartup\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 56,
      "isbn": "9783864142710",
      "labels": [
        {
          "bookId": 56,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        }
      ],
      "language": "de",
      "notes": "",
      "pageCount": 255,
      "position": 55,
      "publishedDate": "2012-03-09",
      "rating": 4,
      "startDate": 1541719007152,
      "state": "READ",
      "subTitle": "Schnell, risikolos und erfolgreich Unternehmen gründen",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d-KGEUgiRZj0C\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Lean Startup",
      "wishlistDate": 1538309310942
    },
    {
      "author": "Carlos Ruiz Zafón",
      "currentPage": 284,
      "endDate": 1532441738879,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dnE1tAgAAQBAJ\u0026source\u003dgbs_api",
      "id": 55,
      "isbn": "9783104012841",
      "labels": [],
      "language": "de",
      "pageCount": 352,
      "position": 56,
      "publishedDate": "2011-04-12",
      "rating": 4,
      "startDate": 1531994400000,
      "state": "READ",
      "subTitle": "Roman",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dnE1tAgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Marina",
      "wishlistDate": 1530517663505
    },
    {
      "author": "Nir Eyal",
      "currentPage": 0,
      "endDate": 1497037709574,
      "googleBooksLink": "http://books.google.at/books?id\u003d0yftoAEACAAJ\u0026dq\u003d9783868815368\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 54,
      "isbn": "9783868815368",
      "labels": [
        {
          "bookId": 54,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        },
        {
          "bookId": 54,
          "hexColor": "#ff2196f3",
          "title": "Science"
        }
      ],
      "language": "de",
      "pageCount": 208,
      "position": 57,
      "publishedDate": "2014-09-12",
      "rating": 3,
      "startDate": 1494082811697,
      "state": "READ",
      "subTitle": "Wie Sie Produkte erschaffen, die süchtig machen",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d0yftoAEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Hooked",
      "wishlistDate": 1494057144183
    },
    {
      "author": "Donald A. Norman",
      "currentPage": 368,
      "endDate": 1514709843214,
      "googleBooksLink": "http://books.google.at/books?id\u003dheCtnQEACAAJ\u0026dq\u003d9780262525671\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 53,
      "isbn": "9780262525671",
      "labels": [
        {
          "bookId": 53,
          "hexColor": "#ff2196f3",
          "title": "Science"
        },
        {
          "bookId": 53,
          "hexColor": "#ff009688",
          "title": "Favorites"
        }
      ],
      "language": "en",
      "pageCount": 368,
      "position": 80,
      "publishedDate": "2013",
      "rating": 5,
      "startDate": 1494082797214,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dheCtnQEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "The Design of Everyday Things",
      "wishlistDate": 1494057157426
    },
    {
      "author": "Carlos Ruiz Zafón",
      "currentPage": 0,
      "endDate": 1492033590966,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dv8VkDQAAQBAJ\u0026source\u003dgbs_api",
      "id": 52,
      "isbn": "9783104033426",
      "labels": [],
      "language": "de",
      "pageCount": 944,
      "position": 84,
      "publishedDate": "2017-03-16",
      "rating": 5,
      "startDate": 1490370984745,
      "state": "READ",
      "subTitle": "Roman",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dv8VkDQAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Das Labyrinth der Lichter",
      "wishlistDate": 0
    },
    {
      "author": "Hermann Hesse",
      "currentPage": 0,
      "endDate": 1490288977185,
      "googleBooksLink": "http://books.google.at/books?id\u003dGhRmjwEACAAJ\u0026dq\u003d9781519701275\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 51,
      "isbn": "9781519701275",
      "labels": [
        {
          "bookId": 51,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 152,
      "position": 87,
      "publishedDate": "2015-12-05",
      "rating": 3,
      "startDate": 1489183983083,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dGhRmjwEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Siddhartha",
      "wishlistDate": 1488621519703
    },
    {
      "author": "Ernest Hemingway",
      "currentPage": 0,
      "endDate": 1488620764577,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dW7hVAwAAQBAJ\u0026source\u003dgbs_api",
      "id": 50,
      "isbn": "9783644043213",
      "labels": [
        {
          "bookId": 50,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 160,
      "position": 88,
      "publishedDate": "2014-06-02",
      "rating": 4,
      "startDate": 1487888930111,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dW7hVAwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Der alte Mann und das Meer",
      "wishlistDate": 1487804319556
    },
    {
      "author": "Jerome D. Salinger",
      "currentPage": 0,
      "endDate": 1495006568567,
      "googleBooksLink": "http://books.google.at/books?id\u003dEVcQSwAACAAJ\u0026dq\u003d9783499235399\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 49,
      "isbn": "9783499235399",
      "labels": [
        {
          "bookId": 49,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 269,
      "position": 89,
      "publishedDate": "2004-01",
      "rating": 1,
      "startDate": 1492033621158,
      "state": "READ",
      "subTitle": "Roman",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dEVcQSwAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Der Fänger im Roggen",
      "wishlistDate": 1487804305131
    },
    {
      "author": "Thomas Glavinic",
      "currentPage": 0,
      "endDate": 1496320100472,
      "googleBooksLink": "http://books.google.at/books?id\u003d7XT6mgEACAAJ\u0026dq\u003d9783423142809\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 48,
      "isbn": "9783423142809",
      "labels": [],
      "language": "de",
      "pageCount": 206,
      "position": 90,
      "publishedDate": "2014-01-01",
      "rating": 3,
      "startDate": 1495814801591,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d7XT6mgEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Unterwegs im Namen des Herrn",
      "wishlistDate": 1487804247981
    },
    {
      "author": "Paulo Coelho",
      "currentPage": 0,
      "endDate": 1489183975160,
      "googleBooksLink": "http://books.google.at/books?id\u003dzwyxGwAACAAJ\u0026dq\u003d9783257233056\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 47,
      "isbn": "9783257233056",
      "labels": [],
      "language": "de",
      "pageCount": 223,
      "position": 91,
      "publishedDate": "2002-01",
      "rating": 3,
      "startDate": 1488621232657,
      "state": "READ",
      "subTitle": "Roman",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dzwyxGwAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Veronika beschliesst zu sterben",
      "wishlistDate": 1487804231986
    },
    {
      "author": "Erich Maria Remarque",
      "currentPage": 0,
      "endDate": 1498315988846,
      "googleBooksLink": "http://books.google.at/books?id\u003dTxr6ngEACAAJ\u0026dq\u003d9783462046304\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 46,
      "isbn": "9783462046304",
      "labels": [],
      "language": "de",
      "pageCount": 413,
      "position": 92,
      "publishedDate": "2014-03-08",
      "rating": 4,
      "startDate": 1497037719986,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dTxr6ngEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Der Weg zurück",
      "wishlistDate": 1487804205394
    },
    {
      "author": "Beatrice Fabregas",
      "currentPage": 0,
      "endDate": 1467280800000,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dmbhsAgAAQBAJ\u0026source\u003dgbs_api",
      "id": 45,
      "isbn": "9783426417744",
      "labels": [],
      "language": "de",
      "pageCount": 550,
      "position": 93,
      "publishedDate": "2013-03-21",
      "rating": 2,
      "startDate": 1465552800000,
      "state": "READ",
      "subTitle": "Roman",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dmbhsAgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Sterne der Karibik",
      "wishlistDate": 0
    },
    {
      "author": "Victor Hugo",
      "currentPage": 0,
      "endDate": 1475229600000,
      "googleBooksLink": "http://books.google.at/books?id\u003dfGi9PQAACAAJ\u0026dq\u003d9782081238060\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 44,
      "isbn": "9783938484524",
      "labels": [],
      "language": "de",
      "pageCount": 94,
      "position": 94,
      "publishedDate": "2005",
      "rating": 3,
      "startDate": 1474279200000,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dfGi9PQAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Der letzte Tag eines Verurteilten",
      "wishlistDate": 0
    },
    {
      "author": "Arthur Schnitzler",
      "currentPage": 0,
      "endDate": 1487262300395,
      "googleBooksLink": "http://books.google.at/books?id\u003d0ALnoAEACAAJ\u0026dq\u003d9783552056930\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 43,
      "isbn": "9783552056930",
      "labels": [],
      "language": "de",
      "pageCount": 156,
      "position": 95,
      "publishedDate": "2014",
      "rating": 3,
      "startDate": 1487262300395,
      "state": "READ",
      "subTitle": "Novelle",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d0ALnoAEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Später Ruhm",
      "wishlistDate": 0
    },
    {
      "author": "Fyodor Dostoyevsky",
      "currentPage": 212,
      "endDate": 1505773610531,
      "googleBooksLink": "http://books.google.at/books?id\u003dWMmTPwAACAAJ\u0026dq\u003d9781592248940\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 42,
      "isbn": "9781592248940",
      "labels": [],
      "language": "de",
      "pageCount": 212,
      "position": 96,
      "publishedDate": "2002-08-01",
      "rating": 2,
      "startDate": 1499711700889,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dWMmTPwAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "The Double",
      "wishlistDate": 1487262198854
    },
    {
      "author": "Daniel Defoe, Kathryn Ann Lindskoog",
      "currentPage": 249,
      "endDate": 1578461825893,
      "googleBooksLink": "http://books.google.at/books?id\u003d2BlWPgAACAAJ\u0026dq\u003d9780875527352\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 41,
      "isbn": "9780875527352",
      "labels": [
        {
          "bookId": 41,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 249,
      "position": 36,
      "publishedDate": "2002-10-01",
      "rating": 3,
      "startDate": 1576100984414,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d2BlWPgAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Robinson Crusoe",
      "wishlistDate": 1446721200000
    },
    {
      "author": "Pierre Boulle, Erich Thanner",
      "currentPage": 0,
      "endDate": 1501067520586,
      "googleBooksLink": "http://books.google.at/books?id\u003dx9IFngEACAAJ\u0026dq\u003d9783730600726\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 40,
      "isbn": "9783730600726",
      "labels": [],
      "language": "de",
      "pageCount": 222,
      "position": 97,
      "publishedDate": "2014-02-28",
      "rating": 4,
      "startDate": 1499711711168,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dx9IFngEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Die Brücke am Kwai (Edition Anaconda)",
      "wishlistDate": 1487261736610
    },
    {
      "author": "Vladimir V. Nabokov, Dieter E. Zimmer",
      "currentPage": 0,
      "endDate": 1478516400000,
      "googleBooksLink": "http://books.google.at/books?id\u003db-rfQwAACAAJ\u0026dq\u003d9783499225437\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 38,
      "isbn": "9783499225437",
      "labels": [
        {
          "bookId": 38,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 527,
      "position": 98,
      "publishedDate": "1999",
      "rating": 4,
      "startDate": 1474884000000,
      "state": "READ",
      "subTitle": "ROMAN. BEARB. V. DIETER E. ZIMMER",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003db-rfQwAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "LOLITA",
      "wishlistDate": 1446678000000
    },
    {
      "author": "M. J. Dougherty",
      "currentPage": 0,
      "endDate": 1473847200000,
      "googleBooksLink": "http://books.google.at/books?id\u003djmhYDQEACAAJ\u0026dq\u003d9780997286434\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 37,
      "isbn": "9780997286434",
      "labels": [
        {
          "bookId": 37,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        }
      ],
      "language": "en",
      "pageCount": 220,
      "position": 88,
      "publishedDate": "2016-08-17",
      "rating": 4,
      "startDate": 1473069600000,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "https://firebasestorage.googleapis.com/v0/b/dante-166506.appspot.com/o/custom_images%2F5w6U2PlW2OhsWGaPspY7SwXQB2L2%2Fimage%3A6868?alt\u003dmedia\u0026token\u003d78abddcc-937e-4dde-892b-e6359c35160f",
      "title": "Life Lessons from a Total Failure",
      "wishlistDate": 1473069600000
    },
    {
      "author": "Thomas Glavinic",
      "currentPage": 0,
      "endDate": 1487260931292,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003de6mqtkFx1awC\u0026source\u003dgbs_api",
      "id": 36,
      "isbn": "9783423411059",
      "labels": [],
      "language": "de",
      "pageCount": 208,
      "position": 100,
      "publishedDate": "2011-11-01",
      "rating": 3,
      "startDate": 1487260931292,
      "state": "READ",
      "subTitle": "Roman",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003de6mqtkFx1awC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Carl Haffners Liebe zum Unentschieden",
      "wishlistDate": 0
    },
    {
      "author": "Laurence Rees",
      "currentPage": 0,
      "endDate": 1474624800000,
      "googleBooksLink": "http://books.google.at/books?id\u003d49Q2WWodc2QC\u0026dq\u003d9780091917593\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 35,
      "isbn": "9780091917593",
      "labels": [
        {
          "bookId": 35,
          "hexColor": "#fff44336",
          "title": "History"
        },
        {
          "bookId": 35,
          "hexColor": "#ff009688",
          "title": "Favorites"
        }
      ],
      "language": "en",
      "pageCount": 310,
      "position": 101,
      "publishedDate": "2008-06-05",
      "rating": 5,
      "startDate": 1473674400000,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d49Q2WWodc2QC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Their Darkest Hour",
      "wishlistDate": 1472594400000
    },
    {
      "author": "Nick Louth",
      "currentPage": 0,
      "endDate": 1454842800000,
      "googleBooksLink": "http://books.google.at/books?id\u003dD1cfrgEACAAJ\u0026dq\u003d9783548287362\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 34,
      "isbn": "9783548287362",
      "labels": [],
      "language": "de",
      "pageCount": 416,
      "position": 102,
      "publishedDate": "2015-05-08",
      "rating": 2,
      "startDate": 1452942000000,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dD1cfrgEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Die Suche",
      "wishlistDate": 1452812400000
    },
    {
      "author": "Herman Melville",
      "currentPage": 0,
      "endDate": 1484478000000,
      "googleBooksLink": "http://books.google.at/books?id\u003dUEVyOQAACAAJ\u0026dq\u003d9783257203851\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 33,
      "isbn": "9783257203851",
      "labels": [
        {
          "bookId": 33,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 582,
      "position": 103,
      "publishedDate": "1977",
      "rating": 3,
      "startDate": 1476871200000,
      "state": "READ",
      "subTitle": "Roman",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dUEVyOQAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Moby-Dick",
      "wishlistDate": 1446678000000
    },
    {
      "author": "Ferenc Máté",
      "currentPage": 0,
      "endDate": 1465466400000,
      "googleBooksLink": "http://books.google.at/books?id\u003dKuzNZwEACAAJ\u0026dq\u003d9783492264273\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 32,
      "isbn": "9783492264273",
      "labels": [],
      "language": "de",
      "pageCount": 271,
      "position": 104,
      "publishedDate": "2011",
      "rating": 3,
      "startDate": 1464775200000,
      "state": "READ",
      "subTitle": "Mein neues Leben in einem alten Land",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dKuzNZwEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Die Hügel der Toskana",
      "wishlistDate": 0
    },
    {
      "author": "Victor Hugo",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003dG-XESAAACAAJ\u0026dq\u003d9783746617008\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 30,
      "isbn": "9783717580065",
      "labels": [
        {
          "bookId": 30,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 608,
      "position": 11,
      "publishedDate": "1985",
      "rating": 0,
      "startDate": 0,
      "state": "READ_LATER",
      "subTitle": "Roman",
      "summary": "",
      "thumbnailAddress": "https://firebasestorage.googleapis.com/v0/b/dante-166506.appspot.com/o/custom_images%2F5w6U2PlW2OhsWGaPspY7SwXQB2L2%2Fimage%3A7121?alt\u003dmedia\u0026token\u003d3408b75d-e497-4fe1-94f8-f3d65098a195",
      "title": "Die Elenden",
      "wishlistDate": 1446721200000
    },
    {
      "author": "Erich Maria Remarque",
      "currentPage": 0,
      "endDate": 1487888875441,
      "googleBooksLink": "http://books.google.at/books?id\u003dPAm8ngEACAAJ\u0026dq\u003d9783462046335\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 29,
      "isbn": "9783462046335",
      "labels": [
        {
          "bookId": 29,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        },
        {
          "bookId": 29,
          "hexColor": "#ff009688",
          "title": "Favorites"
        }
      ],
      "language": "de",
      "pageCount": 324,
      "position": 105,
      "publishedDate": "2014-03-08",
      "rating": 5,
      "startDate": 1487250977914,
      "state": "READ",
      "subTitle": "Roman",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dPAm8ngEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Im Westen nichts Neues",
      "wishlistDate": 1487238290632
    },
    {
      "author": "Daniel Kahneman",
      "currentPage": 624,
      "endDate": 1521361174151,
      "googleBooksLink": "http://books.google.at/books?id\u003dgn25ngEACAAJ\u0026dq\u003d9783570552155\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 28,
      "isbn": "9783570552155",
      "labels": [
        {
          "bookId": 28,
          "hexColor": "#ff2196f3",
          "title": "Science"
        },
        {
          "bookId": 28,
          "hexColor": "#ff009688",
          "title": "Favorites"
        }
      ],
      "language": "de",
      "pageCount": 624,
      "position": 58,
      "publishedDate": "2014-02-24",
      "rating": 5,
      "startDate": 1498470124170,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dgn25ngEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Schnelles Denken, langsames Denken",
      "wishlistDate": 1496424876257
    },
    {
      "author": "Thomas Brezina",
      "currentPage": 416,
      "endDate": 1517574195425,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dTpU9DwAAQBAJ\u0026source\u003dgbs_api",
      "id": 27,
      "isbn": "9783711052261",
      "labels": [],
      "language": "de",
      "notes": "",
      "pageCount": 416,
      "position": 106,
      "publishedDate": "2017-11-09",
      "rating": 2,
      "startDate": 1515835491549,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dTpU9DwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Knickerbocker4immer - Alte Geister ruhen unsanft",
      "wishlistDate": 1515788303614
    },
    {
      "author": "Heinrich Böll",
      "currentPage": 131,
      "endDate": 1519217243576,
      "googleBooksLink": "http://books.google.at/books?id\u003d6wWlygAACAAJ\u0026dq\u003d9783423000017\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 26,
      "isbn": "9783423195041",
      "labels": [],
      "language": "de",
      "notes": "",
      "pageCount": 131,
      "position": 107,
      "publishedDate": "2011",
      "rating": 3,
      "startDate": 1517575439037,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d6wWlygAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Irisches Tagebuch",
      "wishlistDate": 1515788370484
    },
    {
      "author": "Hermann Hesse",
      "currentPage": 288,
      "endDate": 1530514580497,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dw8k7CgAAQBAJ\u0026source\u003dgbs_api",
      "id": 25,
      "isbn": "9783518736104",
      "labels": [
        {
          "bookId": 25,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "notes": "",
      "pageCount": 288,
      "position": 59,
      "publishedDate": "2011-12-14",
      "rating": 3,
      "startDate": 1519217443803,
      "state": "READ",
      "subTitle": "Roman",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dw8k7CgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Der Steppenwolf",
      "wishlistDate": 1515788424638
    },
    {
      "author": "Miguel de Cervantes",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003d8zJHrgEACAAJ\u0026dq\u003d9783423144698\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 24,
      "isbn": "9783423144698",
      "labels": [
        {
          "bookId": 24,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "notes": "",
      "pageCount": 1488,
      "position": 12,
      "publishedDate": "2016-01",
      "rating": -1,
      "startDate": 0,
      "state": "READ_LATER",
      "subTitle": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d8zJHrgEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Don Quijote von der Mancha Teil 1 und 2",
      "wishlistDate": 1515788446112
    },
    {
      "author": "Ernest Hemingway",
      "currentPage": 602,
      "endDate": 1595912961327,
      "googleBooksLink": "http://books.google.at/books?id\u003djacASQAACAAJ\u0026dq\u003d9783596903221\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 23,
      "isbn": "9783596903221",
      "labels": [
        {
          "bookId": 23,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "notes": "",
      "pageCount": 602,
      "position": 16,
      "publishedDate": "2012",
      "rating": 5,
      "startDate": 1594930244839,
      "state": "READ",
      "subTitle": "Roman",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003djacASQAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Wem die Stunde schlägt",
      "wishlistDate": 1515788457573
    },
    {
      "author": "Fjodor M. Dostojewskij",
      "currentPage": 230,
      "endDate": 1589777947840,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dUNFsAgAAQBAJ\u0026source\u003dgbs_api",
      "id": 22,
      "isbn": "9783104020327",
      "labels": [
        {
          "bookId": 22,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "notes": "",
      "pageCount": 230,
      "position": 25,
      "publishedDate": "2012-08-23",
      "rating": 3,
      "startDate": 1589099868535,
      "state": "READ",
      "subTitle": "Roman",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dUNFsAgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Der Spieler",
      "wishlistDate": 1515788588942
    },
    {
      "author": "James Joyce",
      "currentPage": 0,
      "endDate": 0,
      "googleBooksLink": "http://books.google.at/books?id\u003dnJ7hAQAACAAJ\u0026dq\u003dUlysses%2BSuhrkamp\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 21,
      "isbn": "9783518412985",
      "labels": [
        {
          "bookId": 21,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "en",
      "notes": "",
      "pageCount": 987,
      "position": 13,
      "publishedDate": "2001",
      "rating": -1,
      "startDate": 0,
      "state": "READ_LATER",
      "subTitle": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dnJ7hAQAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Ulysses. Sonderausgabe.",
      "wishlistDate": 1515788860887
    },
    {
      "author": "Ryan Holiday",
      "currentPage": 314,
      "endDate": 1541719000761,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dOlWHDQAAQBAJ\u0026source\u003dgbs_api",
      "id": 20,
      "isbn": "9783960920717",
      "labels": [
        {
          "bookId": 20,
          "hexColor": "#ff3f51b5",
          "title": "Stoicism"
        },
        {
          "bookId": 20,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        },
        {
          "bookId": 20,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        },
        {
          "bookId": 20,
          "hexColor": "#ff009688",
          "title": "Favorites"
        }
      ],
      "language": "de",
      "pageCount": 432,
      "position": 60,
      "publishedDate": "2017-03-20",
      "rating": 5,
      "startDate": 1528754400000,
      "state": "READ",
      "subTitle": "366 nachdenkliche Betrachtungen über Weisheit, Beharrlichkeit und Lebensstil",
      "summary": "",
      "thumbnailAddress": "https://books.google.com/books/content?id\u003dOlWHDQAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Der tägliche Stoiker",
      "wishlistDate": 1522150714745
    },
    {
      "author": "Gary Keller, Jay Papasan",
      "currentPage": 218,
      "endDate": 1534263751516,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003ddATDDgAAQBAJ\u0026source\u003dgbs_api",
      "id": 19,
      "isbn": "9783864149757",
      "labels": [
        {
          "bookId": 19,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        },
        {
          "bookId": 19,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        }
      ],
      "language": "de",
      "pageCount": 256,
      "position": 61,
      "publishedDate": "2017-09-11",
      "rating": 3,
      "startDate": 1529445600000,
      "state": "READ",
      "subTitle": "Die überraschend einfache Wahrheit über außergewöhnlichem Erfolg",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003ddATDDgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "The One Thing",
      "wishlistDate": 1522150755959
    },
    {
      "author": "Frank Berzbach",
      "currentPage": 206,
      "endDate": 1530514574415,
      "googleBooksLink": "http://books.google.at/books?id\u003d6oTqmQEACAAJ\u0026dq\u003d9783874398299\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 18,
      "isbn": "9783874398299",
      "labels": [
        {
          "bookId": 18,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        }
      ],
      "language": "de",
      "pageCount": 206,
      "position": 81,
      "publishedDate": "2013",
      "rating": 3,
      "startDate": 1522152612108,
      "state": "READ",
      "subTitle": "oder Anregung zu Achtsamkeit",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d6oTqmQEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Die Kunst, ein kreatives Leben zu führen",
      "wishlistDate": 1522150821887
    },
    {
      "author": "Robert C. Martin",
      "currentPage": 0,
      "endDate": 1530514584833,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003duGE1DwAAQBAJ\u0026source\u003dgbs_api",
      "id": 17,
      "isbn": "9780134494326",
      "labels": [
        {
          "bookId": 17,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "pageCount": 432,
      "position": 85,
      "publishedDate": "2017-09-12",
      "rating": 5,
      "startDate": 1522152616003,
      "state": "READ",
      "subTitle": "A Craftsman\u0027s Guide to Software Structure and Design",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003duGE1DwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Clean Architecture",
      "wishlistDate": 1522151176833
    },
    {
      "author": "E.M. Remarque",
      "currentPage": 0,
      "endDate": 1528322400000,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dE7LGDgAAQBAJ\u0026source\u003dgbs_api",
      "id": 16,
      "isbn": "9783462317527",
      "labels": [],
      "language": "de",
      "pageCount": 384,
      "position": 62,
      "publishedDate": "2017-11-09",
      "rating": 4,
      "startDate": 1526853600000,
      "state": "READ",
      "subTitle": "Roman",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dE7LGDgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Die Nacht von Lissabon",
      "wishlistDate": 1522506042334
    },
    {
      "author": "Max Frisch",
      "currentPage": 203,
      "endDate": 1560237833520,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dpGFFaJR-2HIC\u0026source\u003dgbs_api",
      "id": 15,
      "isbn": "9780547540375",
      "labels": [
        {
          "bookId": 15,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 203,
      "position": 63,
      "publishedDate": "1994-05-01",
      "rating": 5,
      "startDate": 1559885043688,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dpGFFaJR-2HIC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Homo Faber",
      "wishlistDate": 1528754400000
    },
    {
      "author": "George Orwell",
      "currentPage": 104,
      "endDate": 1534402418145,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dXuJsAgAAQBAJ\u0026source\u003dgbs_api",
      "id": 14,
      "isbn": "9783257601114",
      "labels": [
        {
          "bookId": 14,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 160,
      "position": 64,
      "publishedDate": "2012-05-22",
      "rating": 4,
      "startDate": 1534283726783,
      "state": "READ",
      "subTitle": "Ein Märchen",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dXuJsAgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Farm der Tiere",
      "wishlistDate": 1528754400000
    },
    {
      "author": "Ray Bradbury (Schriftsteller)",
      "currentPage": 186,
      "endDate": 1535542759944,
      "googleBooksLink": "http://books.google.at/books?id\u003dTgUMNQEACAAJ\u0026dq\u003dfahrenheit%2B451%2Bdiogenes\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 12,
      "isbn": "9783257261042",
      "labels": [
        {
          "bookId": 12,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 228,
      "position": 65,
      "publishedDate": "2013-08",
      "rating": 4,
      "startDate": 1534426452809,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dTgUMNQEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Fahrenheit 451",
      "wishlistDate": 1527804000000
    },
    {
      "author": "Thomas Brezina, Jan Birck",
      "currentPage": 0,
      "endDate": 1527976800000,
      "googleBooksLink": "http://books.google.at/books?id\u003dfU7TOwAACAAJ\u0026dq\u003d9783473471539\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 11,
      "isbn": "9783473471539",
      "labels": [],
      "language": "de",
      "pageCount": 169,
      "position": 66,
      "publishedDate": "2009",
      "rating": 2,
      "startDate": 1527458400000,
      "state": "READ",
      "subTitle": "Der eiskalte Troll : Abenteuer in Norwegen",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dfU7TOwAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Die Knickerbocker-Bande",
      "wishlistDate": 1525557600000
    },
    {
      "author": "Ferdinand von Schirach",
      "currentPage": 0,
      "endDate": 1529704800000,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003d9ZUmDAAAQBAJ\u0026source\u003dgbs_api",
      "id": 10,
      "isbn": "9783641203290",
      "labels": [],
      "language": "de",
      "pageCount": 176,
      "position": 67,
      "publishedDate": "2016-09-12",
      "rating": 3,
      "startDate": 1529618400000,
      "state": "READ",
      "subTitle": "Ein Theaterstück und eine Rede",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d9ZUmDAAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Terror",
      "wishlistDate": 1527804000000
    },
    {
      "author": "Ferdinand von Schirach",
      "currentPage": 0,
      "endDate": 1529445600000,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dCPgRDgAAQBAJ\u0026source\u003dgbs_api",
      "id": 9,
      "isbn": "9783641203276",
      "labels": [],
      "language": "de",
      "pageCount": 208,
      "position": 68,
      "publishedDate": "2017-02-13",
      "rating": 4,
      "startDate": 1529186400000,
      "state": "READ",
      "subTitle": "Stories",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dCPgRDgAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Schuld",
      "wishlistDate": 1528408800000
    },
    {
      "author": "Ryan Holiday",
      "currentPage": 0,
      "endDate": 1529186400000,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dy1SHDQAAQBAJ\u0026source\u003dgbs_api",
      "id": 8,
      "isbn": "9783960920458",
      "labels": [
        {
          "bookId": 8,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        },
        {
          "bookId": 8,
          "hexColor": "#ff3f51b5",
          "title": "Stoicism"
        },
        {
          "bookId": 8,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        },
        {
          "bookId": 8,
          "hexColor": "#ff009688",
          "title": "Favorites"
        }
      ],
      "language": "de",
      "pageCount": 288,
      "position": 69,
      "publishedDate": "2017-06-10",
      "rating": 5,
      "startDate": 1528754400000,
      "state": "READ",
      "subTitle": "So besiegst du deinen größten Gegner",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dy1SHDQAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Dein Ego ist dein Feind",
      "wishlistDate": 1527026400000
    },
    {
      "author": "Thomas Mann",
      "currentPage": 60,
      "endDate": 1541718998769,
      "googleBooksLink": "http://books.google.at/books?id\u003dcNgWQQAACAAJ\u0026dq\u003d9783596175499\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 7,
      "isbn": "9783596175499",
      "labels": [
        {
          "bookId": 7,
          "hexColor": "#ff9f6459",
          "title": "Classics"
        }
      ],
      "language": "de",
      "pageCount": 139,
      "position": 70,
      "publishedDate": "2007",
      "rating": 3,
      "startDate": 1533846855067,
      "state": "READ",
      "subTitle": "Novelle",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dcNgWQQAACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Der Tod in Venedig",
      "wishlistDate": 1527804000000
    },
    {
      "author": "Hannah O\u0027Brien",
      "currentPage": 432,
      "endDate": 1533309782483,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dI7U_DwAAQBAJ\u0026source\u003dgbs_api",
      "id": 6,
      "isbn": "9783423434034",
      "labels": [],
      "language": "de",
      "pageCount": 432,
      "position": 71,
      "publishedDate": "2018-03-09",
      "rating": 3,
      "startDate": 1532462318097,
      "state": "READ",
      "subTitle": "Kriminalroman",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dI7U_DwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Irisches Erbe",
      "wishlistDate": 1531403772136
    },
    {
      "author": "Andreas Gruber",
      "currentPage": 384,
      "endDate": 1532946318121,
      "googleBooksLink": "http://books.google.at/books?id\u003d_h1ntAEACAAJ\u0026dq\u003d9783442481231\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 5,
      "isbn": "9783442481231",
      "labels": [],
      "language": "de",
      "pageCount": 384,
      "position": 72,
      "publishedDate": "2018-04-16",
      "rating": 2,
      "startDate": 1532462309522,
      "state": "READ",
      "subTitle": "Peter Hogart ermittelt 2 - Thriller",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003d_h1ntAEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "Die Engelsmühle",
      "wishlistDate": 1531570006017
    },
    {
      "author": "Marion Repschläger",
      "currentPage": 88,
      "endDate": 1599801680530,
      "googleBooksLink": "https://play.google.com/store/books/details?id\u003dKALZxBmB2-QC\u0026source\u003dgbs_api",
      "id": 4,
      "isbn": "9783842861398",
      "labels": [
        {
          "bookId": 4,
          "hexColor": "#ff2196f3",
          "title": "Science"
        },
        {
          "bookId": 4,
          "hexColor": "#fff44336",
          "title": "History"
        }
      ],
      "language": "de",
      "pageCount": 88,
      "position": 11,
      "publishedDate": "2011-05",
      "rating": 3,
      "startDate": 1598904562809,
      "state": "READ",
      "subTitle": "",
      "summary": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dKALZxBmB2-QC\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Sport und Medizin in der griechisch-römischen Antike: Die Wurzeln der modernen Sportmedizin, Physiotherapie und Trainingslehre",
      "wishlistDate": 1467194400000
    },
    {
      "author": "Mark Manson",
      "currentPage": 175,
      "endDate": 1544478977238,
      "googleBooksLink": "http://books.google.at/books?id\u003deifwjwEACAAJ\u0026dq\u003d9780062641540\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 3,
      "isbn": "9780062641540",
      "labels": [
        {
          "bookId": 3,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        }
      ],
      "language": "en",
      "pageCount": 224,
      "position": 73,
      "publishedDate": "2016-09-13",
      "rating": 5,
      "startDate": 1543873987337,
      "state": "READ",
      "subTitle": "A Counterintuitive Approach to Living a Good Life",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003deifwjwEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "The Subtle Art of Not Giving a F*ck",
      "wishlistDate": 1542217179799
    },
    {
      "author": "Stephen R. Covey",
      "currentPage": 352,
      "endDate": 1553548970215,
      "googleBooksLink": "http://books.google.at/books?id\u003dSZKRtwEACAAJ\u0026dq\u003d9781416502494\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 2,
      "isbn": "9781416502494",
      "labels": [
        {
          "bookId": 2,
          "hexColor": "#ff00dd99",
          "title": "Entrepreneurship"
        },
        {
          "bookId": 2,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        },
        {
          "bookId": 2,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        },
        {
          "bookId": 2,
          "hexColor": "#ff009688",
          "title": "Favorites"
        }
      ],
      "language": "en",
      "pageCount": 352,
      "position": 74,
      "publishedDate": "2004",
      "rating": 5,
      "startDate": 1544561547599,
      "state": "READ",
      "subTitle": "",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dSZKRtwEACAAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "The 7 Habits of Highly Effective People",
      "wishlistDate": 1542217240504
    },
    {
      "author": "Marc Aurel",
      "currentPage": 104,
      "endDate": 1557983935491,
      "googleBooksLink": "http://books.google.at/books?id\u003dHlhTDwAAQBAJ\u0026dq\u003d9788026859949\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 1,
      "isbn": "9788026859949",
      "labels": [
        {
          "bookId": 1,
          "hexColor": "#ff9c27b0",
          "title": "Personal Growth"
        },
        {
          "bookId": 1,
          "hexColor": "#ff3f51b5",
          "title": "Stoicism"
        },
        {
          "bookId": 1,
          "hexColor": "#ffff6d00",
          "title": "Philosophy"
        }
      ],
      "language": "de",
      "pageCount": 104,
      "position": 82,
      "publishedDate": "2017-11-01",
      "rating": 0,
      "startDate": 1544561543533,
      "state": "READ",
      "subTitle": "Selbsterkenntnisse des römischen Kaisers Marcus Aurelius",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dHlhTDwAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026edge\u003dcurl\u0026source\u003dgbs_api",
      "title": "Marcus Aurelius: Selbstbetrachtungen",
      "wishlistDate": 1542217269651
    },
    {
      "author": "Robert C. Martin",
      "currentPage": 199,
      "endDate": 1543962568282,
      "googleBooksLink": "http://books.google.at/books?id\u003dVQlvAQAAQBAJ\u0026dq\u003d9780137081073\u0026hl\u003d\u0026source\u003dgbs_api",
      "id": 0,
      "isbn": "9780137081073",
      "labels": [
        {
          "bookId": 0,
          "hexColor": "#ff8bc34a",
          "title": "Programming"
        }
      ],
      "language": "en",
      "notes": "Martin ist ein sehr lustiger Zeitgenosse!",
      "pageCount": 210,
      "position": 75,
      "publishedDate": "2011",
      "rating": 5,
      "startDate": 1542217312714,
      "state": "READ",
      "subTitle": "A Code of Conduct for Professional Programmers",
      "thumbnailAddress": "http://books.google.com/books/content?id\u003dVQlvAQAAQBAJ\u0026printsec\u003dfrontcover\u0026img\u003d1\u0026zoom\u003d1\u0026source\u003dgbs_api",
      "title": "The Clean Coder",
      "wishlistDate": 0
    }
  ],
  "records": [
    {
      "bookId": 118,
      "fromPage": 169,
      "timestamp": 1597223567061,
      "toPage": 168
    },
    {
      "bookId": 118,
      "fromPage": 168,
      "timestamp": 1597223642293,
      "toPage": 169
    },
    {
      "bookId": 116,
      "fromPage": 21,
      "timestamp": 1597223791992,
      "toPage": 22
    },
    {
      "bookId": 116,
      "fromPage": 22,
      "timestamp": 1597223797888,
      "toPage": 21
    },
    {
      "bookId": 98,
      "fromPage": 234,
      "timestamp": 1597223802889,
      "toPage": 235
    },
    {
      "bookId": 90,
      "fromPage": 21,
      "timestamp": 1597223809633,
      "toPage": 20
    },
    {
      "bookId": 90,
      "fromPage": 20,
      "timestamp": 1597223815476,
      "toPage": 21
    },
    {
      "bookId": 118,
      "fromPage": 169,
      "timestamp": 1597237815950,
      "toPage": 0
    },
    {
      "bookId": 118,
      "fromPage": 169,
      "timestamp": 1597293572927,
      "toPage": 191
    },
    {
      "bookId": 98,
      "fromPage": 235,
      "timestamp": 1597293972247,
      "toPage": 237
    },
    {
      "bookId": 118,
      "fromPage": 191,
      "timestamp": 1597385237215,
      "toPage": 203
    },
    {
      "bookId": 98,
      "fromPage": 237,
      "timestamp": 1597385268113,
      "toPage": 238
    },
    {
      "bookId": 118,
      "fromPage": 203,
      "timestamp": 1597430121647,
      "toPage": 272
    },
    {
      "bookId": 90,
      "fromPage": 21,
      "timestamp": 1597434623461,
      "toPage": 53
    },
    {
      "bookId": 116,
      "fromPage": 21,
      "timestamp": 1597437193233,
      "toPage": 32
    },
    {
      "bookId": 116,
      "fromPage": 32,
      "timestamp": 1597475006786,
      "toPage": 52
    },
    {
      "bookId": 116,
      "fromPage": 52,
      "timestamp": 1597516901710,
      "toPage": 86
    },
    {
      "bookId": 116,
      "fromPage": 86,
      "timestamp": 1597553412526,
      "toPage": 103
    },
    {
      "bookId": 116,
      "fromPage": 103,
      "timestamp": 1597598344593,
      "toPage": 133
    },
    {
      "bookId": 116,
      "fromPage": 133,
      "timestamp": 1597608187184,
      "toPage": 151
    },
    {
      "bookId": 116,
      "fromPage": 151,
      "timestamp": 1597642456931,
      "toPage": 206
    },
    {
      "bookId": 116,
      "fromPage": 206,
      "timestamp": 1597730201930,
      "toPage": 271
    },
    {
      "bookId": 116,
      "fromPage": 271,
      "timestamp": 1597812499011,
      "toPage": 304
    },
    {
      "bookId": 116,
      "fromPage": 304,
      "timestamp": 1597900088671,
      "toPage": 365
    },
    {
      "bookId": 60,
      "fromPage": 0,
      "timestamp": 1597988892795,
      "toPage": 42
    },
    {
      "bookId": 98,
      "fromPage": 238,
      "timestamp": 1597988971061,
      "toPage": 245
    },
    {
      "bookId": 90,
      "fromPage": 53,
      "timestamp": 1597990106319,
      "toPage": 61
    },
    {
      "bookId": 60,
      "fromPage": 42,
      "timestamp": 1598040012455,
      "toPage": 64
    },
    {
      "bookId": 60,
      "fromPage": 64,
      "timestamp": 1598205394703,
      "toPage": 97
    },
    {
      "bookId": 60,
      "fromPage": 97,
      "timestamp": 1598246792987,
      "toPage": 140
    },
    {
      "bookId": 60,
      "fromPage": 140,
      "timestamp": 1598334043412,
      "toPage": 194
    },
    {
      "bookId": 60,
      "fromPage": 194,
      "timestamp": 1598420669963,
      "toPage": 230
    },
    {
      "bookId": 60,
      "fromPage": 230,
      "timestamp": 1598460218080,
      "toPage": 254
    },
    {
      "bookId": 60,
      "fromPage": 254,
      "timestamp": 1598554180496,
      "toPage": 262
    },
    {
      "bookId": 60,
      "fromPage": 262,
      "timestamp": 1598637340075,
      "toPage": 279
    },
    {
      "bookId": 60,
      "fromPage": 279,
      "timestamp": 1598644720617,
      "toPage": 294
    },
    {
      "bookId": 60,
      "fromPage": 294,
      "timestamp": 1598682644041,
      "toPage": 319
    },
    {
      "bookId": 60,
      "fromPage": 319,
      "timestamp": 1598711336476,
      "toPage": 350
    },
    {
      "bookId": 60,
      "fromPage": 350,
      "timestamp": 1598721493704,
      "toPage": 368
    },
    {
      "bookId": 98,
      "fromPage": 245,
      "timestamp": 1598721520697,
      "toPage": 253
    },
    {
      "bookId": 60,
      "fromPage": 368,
      "timestamp": 1598767566319,
      "toPage": 408
    },
    {
      "bookId": 60,
      "fromPage": 408,
      "timestamp": 1598817498290,
      "toPage": 417
    },
    {
      "bookId": 60,
      "fromPage": 417,
      "timestamp": 1598852651235,
      "toPage": 459
    },
    {
      "bookId": 60,
      "fromPage": 459,
      "timestamp": 1598880765989,
      "toPage": 472
    },
    {
      "bookId": 71,
      "fromPage": 0,
      "timestamp": 1598897101369,
      "toPage": 31
    },
    {
      "bookId": 60,
      "fromPage": 472,
      "timestamp": 1598903266366,
      "toPage": 510
    },
    {
      "bookId": 4,
      "fromPage": 0,
      "timestamp": 1598904573085,
      "toPage": 6
    },
    {
      "bookId": 60,
      "fromPage": 510,
      "timestamp": 1598938915898,
      "toPage": 554
    },
    {
      "bookId": 71,
      "fromPage": 31,
      "timestamp": 1598941079417,
      "toPage": 39
    },
    {
      "bookId": 60,
      "fromPage": 554,
      "timestamp": 1599023229922,
      "toPage": 582
    },
    {
      "bookId": 71,
      "fromPage": 39,
      "timestamp": 1599024620727,
      "toPage": 49
    },
    {
      "bookId": 60,
      "fromPage": 586,
      "timestamp": 1599112216269,
      "toPage": 619
    },
    {
      "bookId": 60,
      "fromPage": 619,
      "timestamp": 1599162233993,
      "toPage": 637
    },
    {
      "bookId": 60,
      "fromPage": 637,
      "timestamp": 1599202584869,
      "toPage": 675
    },
    {
      "bookId": 60,
      "fromPage": 675,
      "timestamp": 1599286747566,
      "toPage": 684
    },
    {
      "bookId": 60,
      "fromPage": 684,
      "timestamp": 1599296502729,
      "toPage": 768
    },
    {
      "bookId": 71,
      "fromPage": 49,
      "timestamp": 1599423696113,
      "toPage": 66
    },
    {
      "bookId": 4,
      "fromPage": 6,
      "timestamp": 1599425496650,
      "toPage": 17
    },
    {
      "bookId": 71,
      "fromPage": 66,
      "timestamp": 1599455342250,
      "toPage": 82
    },
    {
      "bookId": 4,
      "fromPage": 17,
      "timestamp": 1599457243067,
      "toPage": 32
    },
    {
      "bookId": 90,
      "fromPage": 61,
      "timestamp": 1599459458884,
      "toPage": 79
    },
    {
      "bookId": 90,
      "fromPage": 79,
      "timestamp": 1599513285777,
      "toPage": 88
    },
    {
      "bookId": 90,
      "fromPage": 88,
      "timestamp": 1599542429006,
      "toPage": 111
    },
    {
      "bookId": 71,
      "fromPage": 82,
      "timestamp": 1599543773779,
      "toPage": 92
    },
    {
      "bookId": 98,
      "fromPage": 253,
      "timestamp": 1599624535675,
      "toPage": 265
    },
    {
      "bookId": 90,
      "fromPage": 111,
      "timestamp": 1599629780526,
      "toPage": 150
    },
    {
      "bookId": 4,
      "fromPage": 32,
      "timestamp": 1599712875758,
      "toPage": 47
    },
    {
      "bookId": 4,
      "fromPage": 47,
      "timestamp": 1599801681333,
      "toPage": 88
    },
    {
      "bookId": 90,
      "fromPage": 150,
      "timestamp": 1599889892755,
      "toPage": 174
    },
    {
      "bookId": 71,
      "fromPage": 92,
      "timestamp": 1599890594763,
      "toPage": 99
    },
    {
      "bookId": 90,
      "fromPage": 174,
      "timestamp": 1599944769513,
      "toPage": 194
    },
    {
      "bookId": 90,
      "fromPage": 194,
      "timestamp": 1600063610309,
      "toPage": 210
    },
    {
      "bookId": 71,
      "fromPage": 99,
      "timestamp": 1600063627041,
      "toPage": 117
    },
    {
      "bookId": 90,
      "fromPage": 210,
      "timestamp": 1600149481841,
      "toPage": 251
    },
    {
      "bookId": 90,
      "fromPage": 251,
      "timestamp": 1600316867758,
      "toPage": 298
    },
    {
      "bookId": 71,
      "fromPage": 117,
      "timestamp": 1600405287129,
      "toPage": 135
    },
    {
      "bookId": 71,
      "fromPage": 135,
      "timestamp": 1600662089121,
      "toPage": 151
    },
    {
      "bookId": 71,
      "fromPage": 151,
      "timestamp": 1600746506022,
      "toPage": 170
    },
    {
      "bookId": 71,
      "fromPage": 170,
      "timestamp": 1600855447262,
      "toPage": 193
    },
    {
      "bookId": 89,
      "fromPage": 3,
      "timestamp": 1600920944311,
      "toPage": 10
    },
    {
      "bookId": 89,
      "fromPage": 10,
      "timestamp": 1601012846666,
      "toPage": 27
    },
    {
      "bookId": 98,
      "fromPage": 265,
      "timestamp": 1601012879133,
      "toPage": 280
    },
    {
      "bookId": 89,
      "fromPage": 27,
      "timestamp": 1601359197720,
      "toPage": 42
    },
    {
      "bookId": 89,
      "fromPage": 42,
      "timestamp": 1601445343921,
      "toPage": 70
    },
    {
      "bookId": 98,
      "fromPage": 280,
      "timestamp": 1601528956140,
      "toPage": 290
    },
    {
      "bookId": 89,
      "fromPage": 70,
      "timestamp": 1601531424660,
      "toPage": 83
    },
    {
      "bookId": 89,
      "fromPage": 83,
      "timestamp": 1601620214956,
      "toPage": 111
    },
    {
      "bookId": 120,
      "fromPage": 0,
      "timestamp": 1601815801333,
      "toPage": 68
    },
    {
      "bookId": 120,
      "fromPage": 68,
      "timestamp": 1601839106579,
      "toPage": 80
    },
    {
      "bookId": 89,
      "fromPage": 111,
      "timestamp": 1601876874374,
      "toPage": 128
    },
    {
      "bookId": 65,
      "fromPage": 0,
      "timestamp": 1601930448511,
      "toPage": 27
    },
    {
      "bookId": 89,
      "fromPage": 128,
      "timestamp": 1601964059771,
      "toPage": 151
    },
    {
      "bookId": 123,
      "fromPage": 0,
      "timestamp": 1602010939295,
      "toPage": 32
    },
    {
      "bookId": 89,
      "fromPage": 151,
      "timestamp": 1602053366595,
      "toPage": 177
    },
    {
      "bookId": 124,
      "fromPage": 0,
      "timestamp": 1602098550954,
      "toPage": 19
    },
    {
      "bookId": 124,
      "fromPage": 19,
      "timestamp": 1602165691669,
      "toPage": 29
    },
    {
      "bookId": 123,
      "fromPage": 32,
      "timestamp": 1602184152662,
      "toPage": 40
    },
    {
      "bookId": 124,
      "fromPage": 29,
      "timestamp": 1602245366520,
      "toPage": 47
    },
    {
      "bookId": 124,
      "fromPage": 47,
      "timestamp": 1602353036125,
      "toPage": 67
    },
    {
      "bookId": 124,
      "fromPage": 67,
      "timestamp": 1602433303962,
      "toPage": 123
    },
    {
      "bookId": 124,
      "fromPage": 123,
      "timestamp": 1602479914070,
      "toPage": 147
    },
    {
      "bookId": 124,
      "fromPage": 147,
      "timestamp": 1602495380155,
      "toPage": 188
    },
    {
      "bookId": 98,
      "fromPage": 290,
      "timestamp": 1602507503788,
      "toPage": 300
    },
    {
      "bookId": 123,
      "fromPage": 40,
      "timestamp": 1602531831066,
      "toPage": 54
    },
    {
      "bookId": 65,
      "fromPage": 27,
      "timestamp": 1602651756365,
      "toPage": 53
    },
    {
      "bookId": 89,
      "fromPage": 177,
      "timestamp": 1602742566715,
      "toPage": 201
    },
    {
      "bookId": 123,
      "fromPage": 54,
      "timestamp": 1602744925785,
      "toPage": 62
    },
    {
      "bookId": 89,
      "fromPage": 201,
      "timestamp": 1602761540342,
      "toPage": 221
    },
    {
      "bookId": 123,
      "fromPage": 62,
      "timestamp": 1602791876175,
      "toPage": 88
    },
    {
      "bookId": 89,
      "fromPage": 221,
      "timestamp": 1602830377882,
      "toPage": 237
    },
    {
      "bookId": 123,
      "fromPage": 88,
      "timestamp": 1603038506553,
      "toPage": 200
    },
    {
      "bookId": 89,
      "fromPage": 237,
      "timestamp": 1603048480608,
      "toPage": 273
    },
    {
      "bookId": 126,
      "fromPage": 0,
      "timestamp": 1603090459375,
      "toPage": 18
    },
    {
      "bookId": 126,
      "fromPage": 18,
      "timestamp": 1603138692957,
      "toPage": 41
    },
    {
      "bookId": 89,
      "fromPage": 273,
      "timestamp": 1603170027379,
      "toPage": 287
    },
    {
      "bookId": 126,
      "fromPage": 41,
      "timestamp": 1603225591594,
      "toPage": 59
    },
    {
      "bookId": 126,
      "fromPage": 59,
      "timestamp": 1603258284391,
      "toPage": 80
    },
    {
      "bookId": 89,
      "fromPage": 287,
      "timestamp": 1603260701379,
      "toPage": 300
    },
    {
      "bookId": 89,
      "fromPage": 300,
      "timestamp": 1603287694069,
      "toPage": 321
    },
    {
      "bookId": 89,
      "fromPage": 321,
      "timestamp": 1603348197926,
      "toPage": 339
    },
    {
      "bookId": 89,
      "fromPage": 339,
      "timestamp": 1603435675374,
      "toPage": 352
    },
    {
      "bookId": 89,
      "fromPage": 352,
      "timestamp": 1603557993364,
      "toPage": 389
    },
    {
      "bookId": 65,
      "fromPage": 53,
      "timestamp": 1603573930794,
      "toPage": 75
    },
    {
      "bookId": 89,
      "fromPage": 389,
      "timestamp": 1603621024012,
      "toPage": 419
    },
    {
      "bookId": 89,
      "fromPage": 419,
      "timestamp": 1603632114185,
      "toPage": 443
    },
    {
      "bookId": 89,
      "fromPage": 443,
      "timestamp": 1603703135736,
      "toPage": 490
    },
    {
      "bookId": 89,
      "fromPage": 490,
      "timestamp": 1603729781525,
      "toPage": 515
    },
    {
      "bookId": 98,
      "fromPage": 300,
      "timestamp": 1603790545184,
      "toPage": 316
    },
    {
      "bookId": 89,
      "fromPage": 515,
      "timestamp": 1603790554009,
      "toPage": 590
    },
    {
      "bookId": 65,
      "fromPage": 75,
      "timestamp": 1603865833202,
      "toPage": 92
    },
    {
      "bookId": 65,
      "fromPage": 92,
      "timestamp": 1603920126730,
      "toPage": 109
    },
    {
      "bookId": 65,
      "fromPage": 109,
      "timestamp": 1603955490560,
      "toPage": 151
    },
    {
      "bookId": 65,
      "fromPage": 151,
      "timestamp": 1604041635117,
      "toPage": 168
    },
    {
      "bookId": 65,
      "fromPage": 168,
      "timestamp": 1604093497117,
      "toPage": 185
    },
    {
      "bookId": 65,
      "fromPage": 185,
      "timestamp": 1604126301663,
      "toPage": 213
    },
    {
      "bookId": 98,
      "fromPage": 316,
      "timestamp": 1604129142159,
      "toPage": 321
    },
    {
      "bookId": 65,
      "fromPage": 213,
      "timestamp": 1604131207177,
      "toPage": 220
    },
    {
      "bookId": 65,
      "fromPage": 220,
      "timestamp": 1604250869902,
      "toPage": 271
    },
    {
      "bookId": 122,
      "fromPage": 0,
      "timestamp": 1604313121986,
      "toPage": 63
    },
    {
      "bookId": 120,
      "fromPage": 80,
      "timestamp": 1604386483360,
      "toPage": 105
    },
    {
      "bookId": 122,
      "fromPage": 63,
      "timestamp": 1604418517654,
      "toPage": 96
    },
    {
      "bookId": 120,
      "fromPage": 105,
      "timestamp": 1604472878191,
      "toPage": 126
    },
    {
      "bookId": 122,
      "fromPage": 96,
      "timestamp": 1604482723633,
      "toPage": 139
    },
    {
      "bookId": 120,
      "fromPage": 126,
      "timestamp": 1604558976789,
      "toPage": 147
    },
    {
      "bookId": 120,
      "fromPage": 147,
      "timestamp": 1604645601861,
      "toPage": 171
    },
    {
      "bookId": 122,
      "fromPage": 139,
      "timestamp": 1604663512389,
      "toPage": 165
    },
    {
      "bookId": 120,
      "fromPage": 171,
      "timestamp": 1604695597566,
      "toPage": 188
    },
    {
      "bookId": 120,
      "fromPage": 188,
      "timestamp": 1604729607255,
      "toPage": 208
    },
    {
      "bookId": 122,
      "fromPage": 165,
      "timestamp": 1604778728132,
      "toPage": 212
    },
    {
      "bookId": 122,
      "fromPage": 212,
      "timestamp": 1604865971879,
      "toPage": 309
    },
    {
      "bookId": 120,
      "fromPage": 208,
      "timestamp": 1604869265708,
      "toPage": 228
    },
    {
      "bookId": 120,
      "fromPage": 228,
      "timestamp": 1604906837411,
      "toPage": 250
    },
    {
      "bookId": 122,
      "fromPage": 309,
      "timestamp": 1604947522237,
      "toPage": 329
    },
    {
      "bookId": 120,
      "fromPage": 250,
      "timestamp": 1604955569765,
      "toPage": 263
    },
    {
      "bookId": 120,
      "fromPage": 263,
      "timestamp": 1604991232786,
      "toPage": 289
    },
    {
      "bookId": 120,
      "fromPage": 289,
      "timestamp": 1605077607186,
      "toPage": 310
    },
    {
      "bookId": 122,
      "fromPage": 329,
      "timestamp": 1605164344957,
      "toPage": 372
    },
    {
      "bookId": 120,
      "fromPage": 310,
      "timestamp": 1605250453742,
      "toPage": 333
    },
    {
      "bookId": 120,
      "fromPage": 333,
      "timestamp": 1605301592160,
      "toPage": 344
    },
    {
      "bookId": 122,
      "fromPage": 372,
      "timestamp": 1605346129479,
      "toPage": 414
    },
    {
      "bookId": 122,
      "fromPage": 414,
      "timestamp": 1605431676380,
      "toPage": 505
    },
    {
      "bookId": 122,
      "fromPage": 505,
      "timestamp": 1605449686570,
      "toPage": 561
    },
    {
      "bookId": 122,
      "fromPage": 561,
      "timestamp": 1605465873222,
      "toPage": 587
    },
    {
      "bookId": 122,
      "fromPage": 587,
      "timestamp": 1605508714778,
      "toPage": 641
    },
    {
      "bookId": 122,
      "fromPage": 641,
      "timestamp": 1605530226735,
      "toPage": 797
    },
    {
      "bookId": 120,
      "fromPage": 344,
      "timestamp": 1605594754704,
      "toPage": 373
    },
    {
      "bookId": 120,
      "fromPage": 373,
      "timestamp": 1605681560323,
      "toPage": 397
    },
    {
      "bookId": 66,
      "fromPage": 0,
      "timestamp": 1605726933785,
      "toPage": 25
    },
    {
      "bookId": 66,
      "fromPage": 25,
      "timestamp": 1605771445723,
      "toPage": 45
    },
    {
      "bookId": 66,
      "fromPage": 45,
      "timestamp": 1605801409654,
      "toPage": 76
    },
    {
      "bookId": 66,
      "fromPage": 76,
      "timestamp": 1605854184899,
      "toPage": 100
    },
    {
      "bookId": 66,
      "fromPage": 100,
      "timestamp": 1605955225497,
      "toPage": 154
    },
    {
      "bookId": 66,
      "fromPage": 154,
      "timestamp": 1605981900278,
      "toPage": 160
    },
    {
      "bookId": 98,
      "fromPage": 321,
      "timestamp": 1606029916357,
      "toPage": 344
    },
    {
      "bookId": 66,
      "fromPage": 160,
      "timestamp": 1606036666341,
      "toPage": 199
    },
    {
      "bookId": 120,
      "fromPage": 397,
      "timestamp": 1606112321471,
      "toPage": 429
    },
    {
      "bookId": 120,
      "fromPage": 429,
      "timestamp": 1606163895212,
      "toPage": 442
    },
    {
      "bookId": 66,
      "fromPage": 199,
      "timestamp": 1606213619952,
      "toPage": 225
    },
    {
      "bookId": 120,
      "fromPage": 442,
      "timestamp": 1606285466414,
      "toPage": 465
    },
    {
      "bookId": 66,
      "fromPage": 225,
      "timestamp": 1606423881272,
      "toPage": 283
    },
    {
      "bookId": 66,
      "fromPage": 283,
      "timestamp": 1606461575678,
      "toPage": 325
    },
    {
      "bookId": 120,
      "fromPage": 465,
      "timestamp": 1606564249956,
      "toPage": 504
    },
    {
      "bookId": 120,
      "fromPage": 504,
      "timestamp": 1606638054805,
      "toPage": 532
    },
    {
      "bookId": 98,
      "fromPage": 344,
      "timestamp": 1606714843382,
      "toPage": 355
    },
    {
      "bookId": 66,
      "fromPage": 325,
      "timestamp": 1606721668090,
      "toPage": 365
    },
    {
      "bookId": 66,
      "fromPage": 365,
      "timestamp": 1606769709367,
      "toPage": 384
    },
    {
      "bookId": 66,
      "fromPage": 384,
      "timestamp": 1606805456265,
      "toPage": 411
    },
    {
      "bookId": 66,
      "fromPage": 411,
      "timestamp": 1606892882948,
      "toPage": 440
    },
    {
      "bookId": 120,
      "fromPage": 532,
      "timestamp": 1606985153332,
      "toPage": 573
    },
    {
      "bookId": 66,
      "fromPage": 440,
      "timestamp": 1606985169609,
      "toPage": 513
    },
    {
      "bookId": 120,
      "fromPage": 573,
      "timestamp": 1607032837132,
      "toPage": 594
    },
    {
      "bookId": 120,
      "fromPage": 594,
      "timestamp": 1607066582696,
      "toPage": 624
    },
    {
      "bookId": 120,
      "fromPage": 624,
      "timestamp": 1607201561422,
      "toPage": 684
    },
    {
      "bookId": 120,
      "fromPage": 684,
      "timestamp": 1607248306870,
      "toPage": 705
    },
    {
      "bookId": 120,
      "fromPage": 705,
      "timestamp": 1607262552348,
      "toPage": 741
    },
    {
      "bookId": 128,
      "fromPage": 0,
      "timestamp": 1607288802740,
      "toPage": 15
    },
    {
      "bookId": 128,
      "fromPage": 15,
      "timestamp": 1607459408116,
      "toPage": 30
    },
    {
      "bookId": 128,
      "fromPage": 30,
      "timestamp": 1607498731302,
      "toPage": 67
    },
    {
      "bookId": 128,
      "fromPage": 67,
      "timestamp": 1607588022066,
      "toPage": 91
    },
    {
      "bookId": 128,
      "fromPage": 91,
      "timestamp": 1607633363371,
      "toPage": 110
    },
    {
      "bookId": 128,
      "fromPage": 110,
      "timestamp": 1607671357109,
      "toPage": 140
    },
    {
      "bookId": 128,
      "fromPage": 140,
      "timestamp": 1607765748392,
      "toPage": 193
    },
    {
      "bookId": 98,
      "fromPage": 355,
      "timestamp": 1607768022724,
      "toPage": 367
    },
    {
      "bookId": 128,
      "fromPage": 193,
      "timestamp": 1607982859409,
      "toPage": 203
    },
    {
      "bookId": 128,
      "fromPage": 203,
      "timestamp": 1608012370263,
      "toPage": 227
    },
    {
      "bookId": 128,
      "fromPage": 227,
      "timestamp": 1608482495204,
      "toPage": 280
    },
    {
      "bookId": 127,
      "fromPage": 0,
      "timestamp": 1608482521563,
      "toPage": 41
    },
    {
      "bookId": 127,
      "fromPage": 41,
      "timestamp": 1608495570420,
      "toPage": 51
    },
    {
      "bookId": 127,
      "fromPage": 51,
      "timestamp": 1608537144981,
      "toPage": 65
    },
    {
      "bookId": 127,
      "fromPage": 65,
      "timestamp": 1608584391578,
      "toPage": 74
    },
    {
      "bookId": 127,
      "fromPage": 74,
      "timestamp": 1608628151752,
      "toPage": 81
    },
    {
      "bookId": 127,
      "fromPage": 81,
      "timestamp": 1608849495196,
      "toPage": 112
    },
    {
      "bookId": 127,
      "fromPage": 112,
      "timestamp": 1608884051018,
      "toPage": 146
    },
    {
      "bookId": 127,
      "fromPage": 146,
      "timestamp": 1608932032214,
      "toPage": 194
    },
    {
      "bookId": 127,
      "fromPage": 194,
      "timestamp": 1608969226950,
      "toPage": 225
    },
    {
      "bookId": 98,
      "fromPage": 367,
      "timestamp": 1608969727650,
      "toPage": 381
    },
    {
      "bookId": 127,
      "fromPage": 225,
      "timestamp": 1609018568407,
      "toPage": 244
    },
    {
      "bookId": 127,
      "fromPage": 244,
      "timestamp": 1609055262063,
      "toPage": 272
    },
    {
      "bookId": 127,
      "fromPage": 272,
      "timestamp": 1609075491674,
      "toPage": 319
    },
    {
      "bookId": 132,
      "fromPage": 0,
      "timestamp": 1609075507070,
      "toPage": 17
    },
    {
      "bookId": 98,
      "fromPage": 381,
      "timestamp": 1609077795081,
      "toPage": 382
    },
    {
      "bookId": 132,
      "fromPage": 17,
      "timestamp": 1609105751853,
      "toPage": 41
    },
    {
      "bookId": 98,
      "fromPage": 382,
      "timestamp": 1609140797733,
      "toPage": 383
    },
    {
      "bookId": 132,
      "fromPage": 41,
      "timestamp": 1609140810533,
      "toPage": 84
    },
    {
      "bookId": 132,
      "fromPage": 84,
      "timestamp": 1609189461775,
      "toPage": 120
    },
    {
      "bookId": 132,
      "fromPage": 120,
      "timestamp": 1609225667837,
      "toPage": 192
    },
    {
      "bookId": 98,
      "fromPage": 383,
      "timestamp": 1609226024281,
      "toPage": 384
    },
    {
      "bookId": 135,
      "fromPage": 0,
      "timestamp": 1609315984117,
      "toPage": 47
    },
    {
      "bookId": 98,
      "fromPage": 384,
      "timestamp": 1609391770502,
      "toPage": 387
    },
    {
      "bookId": 135,
      "fromPage": 47,
      "timestamp": 1609395168276,
      "toPage": 74
    },
    {
      "bookId": 135,
      "fromPage": 74,
      "timestamp": 1609527906427,
      "toPage": 94
    },
    {
      "bookId": 133,
      "fromPage": 0,
      "timestamp": 1609599240169,
      "toPage": 10
    },
    {
      "bookId": 135,
      "fromPage": 94,
      "timestamp": 1609710517198,
      "toPage": 119
    },
    {
      "bookId": 135,
      "fromPage": 119,
      "timestamp": 1609742353317,
      "toPage": 146
    },
    {
      "bookId": 129,
      "fromPage": 0,
      "timestamp": 1609798537468,
      "toPage": 27
    }
  ]
}
